STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_ca35.h
typedef struct
{
  __IO uint32_t CR;              /*!< CRYP control register,                                    Address offset: 0x00 */
  __IO uint32_t SR;              /*!< CRYP status register,                                     Address offset: 0x04 */
  __IO uint32_t DIN;             /*!< CRYP data input register,                                 Address offset: 0x08 */
  __IO uint32_t DOUT;            /*!< CRYP data output register,                                Address offset: 0x0C */
  __IO uint32_t DMACR;           /*!< CRYP DMA control register,                                Address offset: 0x10 */
  __IO uint32_t IMSCR;           /*!< CRYP interrupt mask set/clear register,                   Address offset: 0x14 */
  __IO uint32_t RISR;            /*!< CRYP raw interrupt status register,                       Address offset: 0x18 */
  __IO uint32_t MISR;            /*!< CRYP masked interrupt status register,                    Address offset: 0x1C */
  __IO uint32_t K0LR;            /*!< CRYP key left  register 0,                                Address offset: 0x20 */
  __IO uint32_t K0RR;            /*!< CRYP key right register 0,                                Address offset: 0x24 */
  __IO uint32_t K1LR;            /*!< CRYP key left  register 1,                                Address offset: 0x28 */
  __IO uint32_t K1RR;            /*!< CRYP key right register 1,                                Address offset: 0x2C */
  __IO uint32_t K2LR;            /*!< CRYP key left  register 2,                                Address offset: 0x30 */
  __IO uint32_t K2RR;            /*!< CRYP key right register 2,                                Address offset: 0x34 */
  __IO uint32_t K3LR;            /*!< CRYP key left  register 3,                                Address offset: 0x38 */
  __IO uint32_t K3RR;            /*!< CRYP key right register 3,                                Address offset: 0x3C */
  __IO uint32_t IV0LR;           /*!< CRYP initialization vector left-word  register 0,         Address offset: 0x40 */
  __IO uint32_t IV0RR;           /*!< CRYP initialization vector right-word register 0,         Address offset: 0x44 */
  __IO uint32_t IV1LR;           /*!< CRYP initialization vector left-word  register 1,         Address offset: 0x48 */
  __IO uint32_t IV1RR;           /*!< CRYP initialization vector right-word register 1,         Address offset: 0x4C */
  __IO uint32_t CSGCMCCM0R;      /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 0,        Address offset: 0x50 */
  __IO uint32_t CSGCMCCM1R;      /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 1,        Address offset: 0x54 */
  __IO uint32_t CSGCMCCM2R;      /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 2,        Address offset: 0x58 */
  __IO uint32_t CSGCMCCM3R;      /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 3,        Address offset: 0x5C */
  __IO uint32_t CSGCMCCM4R;      /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 4,        Address offset: 0x60 */
  __IO uint32_t CSGCMCCM5R;      /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 5,        Address offset: 0x64 */
  __IO uint32_t CSGCMCCM6R;      /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 6,        Address offset: 0x68 */
  __IO uint32_t CSGCMCCM7R;      /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 7,        Address offset: 0x6C */
  __IO uint32_t CSGCM0R;         /*!< CRYP GCM/GMAC context swap register 0,                    Address offset: 0x70 */
  __IO uint32_t CSGCM1R;         /*!< CRYP GCM/GMAC context swap register 1,                    Address offset: 0x74 */
  __IO uint32_t CSGCM2R;         /*!< CRYP GCM/GMAC context swap register 2,                    Address offset: 0x78 */
  __IO uint32_t CSGCM3R;         /*!< CRYP GCM/GMAC context swap register 3,                    Address offset: 0x7C */
  __IO uint32_t CSGCM4R;         /*!< CRYP GCM/GMAC context swap register 4,                    Address offset: 0x80 */
  __IO uint32_t CSGCM5R;         /*!< CRYP GCM/GMAC context swap register 5,                    Address offset: 0x84 */
  __IO uint32_t CSGCM6R;         /*!< CRYP GCM/GMAC context swap register 6,                    Address offset: 0x88 */
  __IO uint32_t CSGCM7R;         /*!< CRYP GCM/GMAC context swap register 7,                    Address offset: 0x8C */
       uint32_t RESERVED0[216];  /*!< Reserved                               Address offset: 0x090-0x3EC */
  __IO uint32_t HWCFGR;          /*!< CRYP hardware configuration register   Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< CRYP version register                  Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< CRYP identification                    Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< CRYP size identification register      Address offset: 0x3FC */
} CRYP_TypeDef;


/**
  * @brief Debug MCU
  */

typedef struct
{
  __IO uint32_t IDCODE;        /*!< MCU device ID code                                          Address offset: 0x00 */
  __IO uint32_t CR;            /*!< DBGMCU Configuration Register                               Address offset: 0x04 */
  __IO uint32_t CRA35;         /*!< DBGMCU Configuration Register CPU1                          Address offset: 0x08 */
  __IO uint32_t RESERVED1;     /*!< Reserved                                                    Address offset: 0x0C */
  __IO uint32_t AHB2LFZ1;      /*!< DBGMCU AHB2 (lowest part) Peripheral Freeze Register CPU1   Address offset: 0x10 */
  __IO uint32_t AHB2HFZ1;      /*!< DBGMCU AHB2 (highest part) Peripheral Freeze Register CPU1  Address offset: 0x14 */
  __IO uint32_t AHB2LFZ2;      /*!< DBGMCU AHB2 (lowest part) Peripheral Freeze Register CPU2   Address offset: 0x18 */
  __IO uint32_t AHB2HFZ2;      /*!< DBGMCU AHB2 (highest part) Peripheral Freeze Register CPU2  Address offset: 0x1C */
  __IO uint32_t AHBSRFZ1;      /*!< DBGMCU AHBSR Peripheral Freeze Register CPU1                Address offset: 0x20 */
  __IO uint32_t AHBSRFZ2;      /*!< DBGMCU AHBSR Peripheral Freeze Register CPU2                Address offset: 0x24 */
  __IO uint32_t AHBSRFZ3;      /*!< DBGMCU AHBSR Peripheral Freeze Register CPU3                Address offset: 0x28 */
  __IO uint32_t APB1FZ1;       /*!< DBGMCU APB1 Peripheral Freeze Register CPU1                 Address offset: 0x2C */
  __IO uint32_t APB1FZ2;       /*!< DBGMCU APB1 Peripheral Freeze Register CPU2                 Address offset: 0x30 */
  __IO uint32_t APB2FZ1;       /*!< DBGMCU APB2 Peripheral Freeze Register CPU1                 Address offset: 0x34 */
  __IO uint32_t APB2FZ2;       /*!< DBGMCU APB2 Peripheral Freeze Register CPU2                 Address offset: 0x38 */
  __IO uint32_t APB3FZ1;       /*!< DBGMCU APB3 Peripheral Freeze Register CPU1                 Address offset: 0x3C */
  __IO uint32_t APB3FZ2;       /*!< DBGMCU APB3 Peripheral Freeze Register CPU2                 Address offset: 0x40 */
  __IO uint32_t APBSRFZ1;      /*!< DBGMCU APBSR Peripheral Freeze Register CPU1                Address offset: 0x44 */
  __IO uint32_t APBSRFZ2;      /*!< DBGMCU APBSR Peripheral Freeze Register CPU2                Address offset: 0x48 */
  __IO uint32_t APBSRFZ3;      /*!< DBGMCU APBSR Peripheral Freeze Register CPU3                Address offset: 0x4C */
} DBGMCU_TypeDef;

/**
  * @brief DCMI
  */

typedef struct
{
  __IO uint32_t CR;       /*!< DCMI control register 1,                       Address offset: 0x000 */
  __IO uint32_t SR;       /*!< DCMI status register,                          Address offset: 0x004 */
  __IO uint32_t RISR;     /*!< DCMI raw interrupt status register,            Address offset: 0x008 */
  __IO uint32_t IER;      /*!< DCMI interrupt enable register,                Address offset: 0x00C */
  __IO uint32_t MISR;     /*!< DCMI masked interrupt status register,         Address offset: 0x010 */
  __IO uint32_t ICR;      /*!< DCMI interrupt clear register,                 Address offset: 0x014 */
  __IO uint32_t ESCR;     /*!< DCMI embedded synchronization code register,   Address offset: 0x018 */
  __IO uint32_t ESUR;     /*!< DCMI embedded synchronization unmask register, Address offset: 0x01C */
  __IO uint32_t CWSTRTR;  /*!< DCMI crop window start,                        Address offset: 0x020 */
  __IO uint32_t CWSIZER;  /*!< DCMI crop window size,                         Address offset: 0x024 */
  __IO uint32_t DR;       /*!< DCMI data register,                            Address offset: 0x028 */
  uint32_t RESERVED[242]; /*!< Reserved,                                              0x02C - 0x3F0 */
  __IO uint32_t VERR;     /*!< DCMI Version register,                         Address offset: 0x3F4 */
  __IO uint32_t IPDR;     /*!< DCMI Identification register,                  Address offset: 0x3F8 */
  __IO uint32_t SIDR;     /*!< DCMI Size Identification register,             Address offset: 0x3FC */
} DCMI_TypeDef;

