STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_ca35.h
/***************  Bit definition for ETH_MACDR register  ***************/
#define ETH_MACDR_RPESTS_Pos                (0U)
#define ETH_MACDR_RPESTS_Msk                (0x1UL << ETH_MACDR_RPESTS_Pos)                      /*!< 0x00000001 */
#define ETH_MACDR_RPESTS                    ETH_MACDR_RPESTS_Msk                                /*!< MAC GMII or MII Receive Protocol Engine Status */
#define ETH_MACDR_RFCFCSTS_Pos              (1U)
#define ETH_MACDR_RFCFCSTS_Msk              (0x3UL << ETH_MACDR_RFCFCSTS_Pos)                    /*!< 0x00000006 */
#define ETH_MACDR_RFCFCSTS                  ETH_MACDR_RFCFCSTS_Msk                              /*!< MAC Receive Packet Controller FIFO Status */
#define ETH_MACDR_RFCFCSTS_0                (0x1UL << ETH_MACDR_RFCFCSTS_Pos)                    /*!< 0x00000002 */
#define ETH_MACDR_RFCFCSTS_1                (0x2UL << ETH_MACDR_RFCFCSTS_Pos)                    /*!< 0x00000004 */
#define ETH_MACDR_TPESTS_Pos                (16U)
#define ETH_MACDR_TPESTS_Msk                (0x1UL << ETH_MACDR_TPESTS_Pos)                      /*!< 0x00010000 */
#define ETH_MACDR_TPESTS                    ETH_MACDR_TPESTS_Msk                                /*!< MAC GMII or MII Transmit Protocol Engine Status */
#define ETH_MACDR_TFCSTS_Pos                (17U)
#define ETH_MACDR_TFCSTS_Msk                (0x3UL << ETH_MACDR_TFCSTS_Pos)                      /*!< 0x00060000 */
#define ETH_MACDR_TFCSTS                    ETH_MACDR_TFCSTS_Msk                                /*!< MAC Transmit Packet Controller Status */
#define ETH_MACDR_TFCSTS_0                  (0x1UL << ETH_MACDR_TFCSTS_Pos)                      /*!< 0x00020000 */
#define ETH_MACDR_TFCSTS_1                  (0x2UL << ETH_MACDR_TFCSTS_Pos)                      /*!< 0x00040000 */

/*****************  Bit definition for ETH_MACHWF0R register  *****************/
#define ETH_MACHWF0R_MIISEL_Pos             (0U)
#define ETH_MACHWF0R_MIISEL_Msk             (0x1UL << ETH_MACHWF0R_MIISEL_Pos)                    /*!< 0x00000001 */
#define ETH_MACHWF0R_MIISEL                 ETH_MACHWF0R_MIISEL_Msk                              /*!< 10 or 100 Mbps Support */
#define ETH_MACHWF0R_GMIISEL_Pos            (1U)
#define ETH_MACHWF0R_GMIISEL_Msk            (0x1UL << ETH_MACHWF0R_GMIISEL_Pos)                   /*!< 0x00000002 */
#define ETH_MACHWF0R_GMIISEL                ETH_MACHWF0R_GMIISEL_Msk                             /*!< 1000 Mbps Support */
#define ETH_MACHWF0R_HDSEL_Pos              (2U)
#define ETH_MACHWF0R_HDSEL_Msk              (0x1UL << ETH_MACHWF0R_HDSEL_Pos)                     /*!< 0x00000004 */
#define ETH_MACHWF0R_HDSEL                  ETH_MACHWF0R_HDSEL_Msk                               /*!< Half-duplex Support */
#define ETH_MACHWF0R_PCSSEL_Pos             (3U)
#define ETH_MACHWF0R_PCSSEL_Msk             (0x1UL << ETH_MACHWF0R_PCSSEL_Pos)                    /*!< 0x00000008 */
#define ETH_MACHWF0R_PCSSEL                 ETH_MACHWF0R_PCSSEL_Msk                              /*!< PCS Registers (TBI, SGMII, or RTBI PHY interface) */
#define ETH_MACHWF0R_VLHASH_Pos             (4U)
#define ETH_MACHWF0R_VLHASH_Msk             (0x1UL << ETH_MACHWF0R_VLHASH_Pos)                    /*!< 0x00000010 */
#define ETH_MACHWF0R_VLHASH                 ETH_MACHWF0R_VLHASH_Msk                              /*!< VLAN Hash Filter Selected */
#define ETH_MACHWF0R_SMASEL_Pos             (5U)
#define ETH_MACHWF0R_SMASEL_Msk             (0x1UL << ETH_MACHWF0R_SMASEL_Pos)                    /*!< 0x00000020 */
#define ETH_MACHWF0R_SMASEL                 ETH_MACHWF0R_SMASEL_Msk                              /*!< SMA (MDIO) Interface */
#define ETH_MACHWF0R_RWKSEL_Pos             (6U)
#define ETH_MACHWF0R_RWKSEL_Msk             (0x1UL << ETH_MACHWF0R_RWKSEL_Pos)                    /*!< 0x00000040 */
#define ETH_MACHWF0R_RWKSEL                 ETH_MACHWF0R_RWKSEL_Msk                              /*!< PMT Remote Wake-up Packet Enable */
#define ETH_MACHWF0R_MGKSEL_Pos             (7U)
#define ETH_MACHWF0R_MGKSEL_Msk             (0x1UL << ETH_MACHWF0R_MGKSEL_Pos)                    /*!< 0x00000080 */
#define ETH_MACHWF0R_MGKSEL                 ETH_MACHWF0R_MGKSEL_Msk                              /*!< PMT Magic Packet Enable */
#define ETH_MACHWF0R_MMCSEL_Pos             (8U)
#define ETH_MACHWF0R_MMCSEL_Msk             (0x1UL << ETH_MACHWF0R_MMCSEL_Pos)                    /*!< 0x00000100 */
#define ETH_MACHWF0R_MMCSEL                 ETH_MACHWF0R_MMCSEL_Msk                              /*!< RMON Module Enable */
#define ETH_MACHWF0R_ARPOFFSEL_Pos          (9U)
#define ETH_MACHWF0R_ARPOFFSEL_Msk          (0x1UL << ETH_MACHWF0R_ARPOFFSEL_Pos)                 /*!< 0x00000200 */
#define ETH_MACHWF0R_ARPOFFSEL              ETH_MACHWF0R_ARPOFFSEL_Msk                           /*!< ARP Offload Enabled */
#define ETH_MACHWF0R_TSSEL_Pos              (12U)
#define ETH_MACHWF0R_TSSEL_Msk              (0x1UL << ETH_MACHWF0R_TSSEL_Pos)                     /*!< 0x00001000 */
#define ETH_MACHWF0R_TSSEL                  ETH_MACHWF0R_TSSEL_Msk                               /*!< IEEE 1588-2008 Timestamp Enabled */
#define ETH_MACHWF0R_EEESEL_Pos             (13U)
#define ETH_MACHWF0R_EEESEL_Msk             (0x1UL << ETH_MACHWF0R_EEESEL_Pos)                    /*!< 0x00002000 */
#define ETH_MACHWF0R_EEESEL                 ETH_MACHWF0R_EEESEL_Msk                              /*!< Energy Efficient Ethernet Enabled */
#define ETH_MACHWF0R_TXCOESEL_Pos           (14U)
#define ETH_MACHWF0R_TXCOESEL_Msk           (0x1UL << ETH_MACHWF0R_TXCOESEL_Pos)                  /*!< 0x00004000 */
#define ETH_MACHWF0R_TXCOESEL               ETH_MACHWF0R_TXCOESEL_Msk                            /*!< Transmit Checksum Offload Enabled */
#define ETH_MACHWF0R_RXCOESEL_Pos           (16U)
#define ETH_MACHWF0R_RXCOESEL_Msk           (0x1UL << ETH_MACHWF0R_RXCOESEL_Pos)                  /*!< 0x00010000 */
#define ETH_MACHWF0R_RXCOESEL               ETH_MACHWF0R_RXCOESEL_Msk                            /*!< Receive Checksum Offload Enabled */
#define ETH_MACHWF0R_ADDMACADRSEL_Pos       (18U)
#define ETH_MACHWF0R_ADDMACADRSEL_Msk       (0x1FU << ETH_MACHWF0R_ADDMACADRSEL_Pos)             /*!< 0x007C0000 */
#define ETH_MACHWF0R_ADDMACADRSEL           ETH_MACHWF0R_ADDMACADRSEL_Msk                        /*!< MAC Addresses 1-31 Selected */
#define ETH_MACHWF0R_MACADR32SEL_Pos        (23U)
#define ETH_MACHWF0R_MACADR32SEL_Msk        (0x1UL << ETH_MACHWF0R_MACADR32SEL_Pos)               /*!< 0x00800000 */
#define ETH_MACHWF0R_MACADR32SEL            ETH_MACHWF0R_MACADR32SEL_Msk                         /*!< MAC Addresses 32-63 Selected */
#define ETH_MACHWF0R_MACADR64SEL_Pos        (24U)
#define ETH_MACHWF0R_MACADR64SEL_Msk        (0x1UL << ETH_MACHWF0R_MACADR64SEL_Pos)               /*!< 0x01000000 */
#define ETH_MACHWF0R_MACADR64SEL            ETH_MACHWF0R_MACADR64SEL_Msk                         /*!< MAC Addresses 64-127 Selected */
#define ETH_MACHWF0R_TSSTSSEL_Pos           (25U)
#define ETH_MACHWF0R_TSSTSSEL_Msk           (0x3U << ETH_MACHWF0R_TSSTSSEL_Pos)                  /*!< 0x06000000 */
#define ETH_MACHWF0R_TSSTSSEL               ETH_MACHWF0R_TSSTSSEL_Msk                            /*!< Timestamp System Time Source */
#define ETH_MACHWF0R_SAVLANINS_Pos          (27U)
#define ETH_MACHWF0R_SAVLANINS_Msk          (0x1UL << ETH_MACHWF0R_SAVLANINS_Pos)                 /*!< 0x08000000 */
#define ETH_MACHWF0R_SAVLANINS              ETH_MACHWF0R_SAVLANINS_Msk                           /*!< Source Address or VLAN Insertion Enable */
#define ETH_MACHWF0R_ACTPHYSEL_Pos          (28U)
#define ETH_MACHWF0R_ACTPHYSEL_Msk          (0x7U << ETH_MACHWF0R_ACTPHYSEL_Pos)                 /*!< 0x70000000 */
#define ETH_MACHWF0R_ACTPHYSEL              ETH_MACHWF0R_ACTPHYSEL_Msk                           /*!< Active PHY Selected */

/*************  Bit definition for ETH_MACHWF1R register  **************/
#define ETH_MACHWF1R_RXFIFOSIZE_Pos         (0U)
#define ETH_MACHWF1R_RXFIFOSIZE_Msk         (0x1FUL << ETH_MACHWF1R_RXFIFOSIZE_Pos)              /*!< 0x0000001F */
#define ETH_MACHWF1R_RXFIFOSIZE             ETH_MACHWF1R_RXFIFOSIZE_Msk                         /*!< MTL Receive FIFO Size */
#define ETH_MACHWF1R_RXFIFOSIZE_0           (0x1UL << ETH_MACHWF1R_RXFIFOSIZE_Pos)               /*!< 0x00000001 */
#define ETH_MACHWF1R_RXFIFOSIZE_1           (0x2UL << ETH_MACHWF1R_RXFIFOSIZE_Pos)               /*!< 0x00000002 */
#define ETH_MACHWF1R_RXFIFOSIZE_2           (0x4UL << ETH_MACHWF1R_RXFIFOSIZE_Pos)               /*!< 0x00000004 */
#define ETH_MACHWF1R_RXFIFOSIZE_3           (0x8UL << ETH_MACHWF1R_RXFIFOSIZE_Pos)               /*!< 0x00000008 */
#define ETH_MACHWF1R_RXFIFOSIZE_4           (0x10UL << ETH_MACHWF1R_RXFIFOSIZE_Pos)              /*!< 0x00000010 */
#define ETH_MACHWF1R_SPRAM_Pos              (5U)
#define ETH_MACHWF1R_SPRAM_Msk              (0x1UL << ETH_MACHWF1R_SPRAM_Pos)                     /*!< 0x00000020 */
#define ETH_MACHWF1R_SPRAM                  ETH_MACHWF1R_SPRAM_Msk                               /*!< Single Port RAM Enable */
#define ETH_MACHWF1R_TXFIFOSIZE_Pos         (6U)
#define ETH_MACHWF1R_TXFIFOSIZE_Msk         (0x1FUL << ETH_MACHWF1R_TXFIFOSIZE_Pos)              /*!< 0x000007C0 */
#define ETH_MACHWF1R_TXFIFOSIZE             ETH_MACHWF1R_TXFIFOSIZE_Msk                         /*!< MTL Transmit FIFO Size */
#define ETH_MACHWF1R_TXFIFOSIZE_0           (0x1UL << ETH_MACHWF1R_TXFIFOSIZE_Pos)               /*!< 0x00000040 */
#define ETH_MACHWF1R_TXFIFOSIZE_1           (0x2UL << ETH_MACHWF1R_TXFIFOSIZE_Pos)               /*!< 0x00000080 */
#define ETH_MACHWF1R_TXFIFOSIZE_2           (0x4UL << ETH_MACHWF1R_TXFIFOSIZE_Pos)               /*!< 0x00000100 */
#define ETH_MACHWF1R_TXFIFOSIZE_3           (0x8UL << ETH_MACHWF1R_TXFIFOSIZE_Pos)               /*!< 0x00000200 */
#define ETH_MACHWF1R_TXFIFOSIZE_4           (0x10UL << ETH_MACHWF1R_TXFIFOSIZE_Pos)              /*!< 0x00000400 */
#define ETH_MACHWF1R_OSTEN_Pos              (11U)
#define ETH_MACHWF1R_OSTEN_Msk              (0x1UL << ETH_MACHWF1R_OSTEN_Pos)                    /*!< 0x00000800 */
#define ETH_MACHWF1R_OSTEN                  ETH_MACHWF1R_OSTEN_Msk                              /*!< One-Step Timestamping Enable */
#define ETH_MACHWF1R_PTOEN_Pos              (12U)
#define ETH_MACHWF1R_PTOEN_Msk              (0x1UL << ETH_MACHWF1R_PTOEN_Pos)                    /*!< 0x00001000 */
#define ETH_MACHWF1R_PTOEN                  ETH_MACHWF1R_PTOEN_Msk                              /*!< PTP Offload Enable */
#define ETH_MACHWF1R_ADVTHWORD_Pos          (13U)
#define ETH_MACHWF1R_ADVTHWORD_Msk          (0x1UL << ETH_MACHWF1R_ADVTHWORD_Pos)                /*!< 0x00002000 */
#define ETH_MACHWF1R_ADVTHWORD              ETH_MACHWF1R_ADVTHWORD_Msk                          /*!< IEEE 1588 High Word Register Enable */
#define ETH_MACHWF1R_ADDR64_Pos             (14U)
#define ETH_MACHWF1R_ADDR64_Msk             (0x3UL << ETH_MACHWF1R_ADDR64_Pos)                   /*!< 0x0000C000 */
#define ETH_MACHWF1R_ADDR64                 ETH_MACHWF1R_ADDR64_Msk                             /*!< Address width */
#define ETH_MACHWF1R_ADDR64_0               (0x1UL << ETH_MACHWF1R_ADDR64_Pos)                   /*!< 0x00004000 */
#define ETH_MACHWF1R_ADDR64_1               (0x2UL << ETH_MACHWF1R_ADDR64_Pos)                   /*!< 0x00008000 */
#define ETH_MACHWF1R_DCBEN_Pos              (16U)
#define ETH_MACHWF1R_DCBEN_Msk              (0x1UL << ETH_MACHWF1R_DCBEN_Pos)                    /*!< 0x00010000 */
#define ETH_MACHWF1R_DCBEN                  ETH_MACHWF1R_DCBEN_Msk                              /*!< DCB Feature Enable */
#define ETH_MACHWF1R_SPHEN_Pos              (17U)
#define ETH_MACHWF1R_SPHEN_Msk              (0x1UL << ETH_MACHWF1R_SPHEN_Pos)                    /*!< 0x00020000 */
#define ETH_MACHWF1R_SPHEN                  ETH_MACHWF1R_SPHEN_Msk                              /*!< Split Header Feature Enable */
#define ETH_MACHWF1R_TSOEN_Pos              (18U)
#define ETH_MACHWF1R_TSOEN_Msk              (0x1UL << ETH_MACHWF1R_TSOEN_Pos)                    /*!< 0x00040000 */
#define ETH_MACHWF1R_TSOEN                  ETH_MACHWF1R_TSOEN_Msk                              /*!< TCP Segmentation Offload Enable */
#define ETH_MACHWF1R_DBGMEMA_Pos            (19U)
#define ETH_MACHWF1R_DBGMEMA_Msk            (0x1UL << ETH_MACHWF1R_DBGMEMA_Pos)                  /*!< 0x00080000 */
#define ETH_MACHWF1R_DBGMEMA                ETH_MACHWF1R_DBGMEMA_Msk                            /*!< DMA Debug Registers Enable */
#define ETH_MACHWF1R_AVSEL_Pos              (20U)
#define ETH_MACHWF1R_AVSEL_Msk              (0x1UL << ETH_MACHWF1R_AVSEL_Pos)                    /*!< 0x00100000 */
#define ETH_MACHWF1R_AVSEL                  ETH_MACHWF1R_AVSEL_Msk                              /*!< AV Feature Enable */
#define ETH_MACHWF1R_RAVSEL_Pos             (21U)
#define ETH_MACHWF1R_RAVSEL_Msk             (0x1UL << ETH_MACHWF1R_RAVSEL_Pos)                    /*!< 0x00200000 */
#define ETH_MACHWF1R_RAVSEL                 ETH_MACHWF1R_RAVSEL_Msk                             /*!< Rx Side Only AV Feature Enable */
#define ETH_MACHWF1R_POUOST_Pos             (23U)
#define ETH_MACHWF1R_POUOST_Msk             (0x1UL << ETH_MACHWF1R_POUOST_Pos)                    /*!< 0x00800000 */
#define ETH_MACHWF1R_POUOST                 ETH_MACHWF1R_POUOST_Msk                             /*!< One Step for PTP over UDP/IP Feature Enable */
#define ETH_MACHWF1R_HASHTBLSZ_Pos          (24U)
#define ETH_MACHWF1R_HASHTBLSZ_Msk          (0x3UL << ETH_MACHWF1R_HASHTBLSZ_Pos)                /*!< 0x03000000 */
#define ETH_MACHWF1R_HASHTBLSZ              ETH_MACHWF1R_HASHTBLSZ_Msk                          /*!< Hash Table Size */
#define ETH_MACHWF1R_HASHTBLSZ_0            (0x1UL << ETH_MACHWF1R_HASHTBLSZ_Pos)                /*!< 0x01000000 */
#define ETH_MACHWF1R_HASHTBLSZ_1            (0x2UL << ETH_MACHWF1R_HASHTBLSZ_Pos)                /*!< 0x02000000 */
#define ETH_MACHWF1R_L3L4FNUM_Pos           (27U)
#define ETH_MACHWF1R_L3L4FNUM_Msk           (0xFUL << ETH_MACHWF1R_L3L4FNUM_Pos)                 /*!< 0x78000000 */
#define ETH_MACHWF1R_L3L4FNUM               ETH_MACHWF1R_L3L4FNUM_Msk                           /*!< Total number of L3 or L4 Filters */
#define ETH_MACHWF1R_L3L4FNUM_0             (0x1UL << ETH_MACHWF1R_L3L4FNUM_Pos)                 /*!< 0x08000000 */
#define ETH_MACHWF1R_L3L4FNUM_1             (0x2UL << ETH_MACHWF1R_L3L4FNUM_Pos)                 /*!< 0x10000000 */
#define ETH_MACHWF1R_L3L4FNUM_2             (0x4UL << ETH_MACHWF1R_L3L4FNUM_Pos)                 /*!< 0x20000000 */
#define ETH_MACHWF1R_L3L4FNUM_3             (0x8UL << ETH_MACHWF1R_L3L4FNUM_Pos)                 /*!< 0x40000000 */

/*************  Bit definition for ETH_MACHWF2R register  **************/
#define ETH_MACHWF2R_RXQCNT_Pos             (0U)
#define ETH_MACHWF2R_RXQCNT_Msk             (0xFUL << ETH_MACHWF2R_RXQCNT_Pos)                   /*!< 0x0000000F */
#define ETH_MACHWF2R_RXQCNT                 ETH_MACHWF2R_RXQCNT_Msk                             /*!< Number of MTL Receive Queues */
#define ETH_MACHWF2R_RXQCNT_0               (0x1UL << ETH_MACHWF2R_RXQCNT_Pos)                   /*!< 0x00000001 */
#define ETH_MACHWF2R_RXQCNT_1               (0x2UL << ETH_MACHWF2R_RXQCNT_Pos)                   /*!< 0x00000002 */
#define ETH_MACHWF2R_RXQCNT_2               (0x4UL << ETH_MACHWF2R_RXQCNT_Pos)                   /*!< 0x00000004 */
#define ETH_MACHWF2R_RXQCNT_3               (0x8UL << ETH_MACHWF2R_RXQCNT_Pos)                   /*!< 0x00000008 */
#define ETH_MACHWF2R_TXQCNT_Pos             (6U)
#define ETH_MACHWF2R_TXQCNT_Msk             (0xFUL << ETH_MACHWF2R_TXQCNT_Pos)                   /*!< 0x000003C0 */
#define ETH_MACHWF2R_TXQCNT                 ETH_MACHWF2R_TXQCNT_Msk                             /*!< Number of MTL Transmit Queues */
#define ETH_MACHWF2R_TXQCNT_0               (0x1UL << ETH_MACHWF2R_TXQCNT_Pos)                   /*!< 0x00000040 */
#define ETH_MACHWF2R_TXQCNT_1               (0x2UL << ETH_MACHWF2R_TXQCNT_Pos)                   /*!< 0x00000080 */
#define ETH_MACHWF2R_TXQCNT_2               (0x4UL << ETH_MACHWF2R_TXQCNT_Pos)                   /*!< 0x00000100 */
#define ETH_MACHWF2R_TXQCNT_3               (0x8UL << ETH_MACHWF2R_TXQCNT_Pos)                   /*!< 0x00000200 */
#define ETH_MACHWF2R_RXCHCNT_Pos            (12U)
#define ETH_MACHWF2R_RXCHCNT_Msk            (0xFUL << ETH_MACHWF2R_RXCHCNT_Pos)                  /*!< 0x0000F000 */
#define ETH_MACHWF2R_RXCHCNT                ETH_MACHWF2R_RXCHCNT_Msk                            /*!< Number of DMA Receive Channels */
#define ETH_MACHWF2R_RXCHCNT_0              (0x1UL << ETH_MACHWF2R_RXCHCNT_Pos)                  /*!< 0x00001000 */
#define ETH_MACHWF2R_RXCHCNT_1              (0x2UL << ETH_MACHWF2R_RXCHCNT_Pos)                  /*!< 0x00002000 */
#define ETH_MACHWF2R_RXCHCNT_2              (0x4UL << ETH_MACHWF2R_RXCHCNT_Pos)                  /*!< 0x00004000 */
#define ETH_MACHWF2R_RXCHCNT_3              (0x8UL << ETH_MACHWF2R_RXCHCNT_Pos)                  /*!< 0x00008000 */
#define ETH_MACHWF2R_RDCSZ_Pos              (16U)
#define ETH_MACHWF2R_RDCSZ_Msk              (0x3UL << ETH_MACHWF2R_RDCSZ_Pos)                     /*!< 0x00030000 */
#define ETH_MACHWF2R_RDCSZ                  ETH_MACHWF2R_RDCSZ_Msk                              /*!< Rx DMA Descriptor Cache Size in terms of 16-byte descriptors */
#define ETH_MACHWF2R_TXCHCNT_Pos            (18U)
#define ETH_MACHWF2R_TXCHCNT_Msk            (0xFUL << ETH_MACHWF2R_TXCHCNT_Pos)                  /*!< 0x003C0000 */
#define ETH_MACHWF2R_TXCHCNT                ETH_MACHWF2R_TXCHCNT_Msk                            /*!< Number of DMA Transmit Channels */
#define ETH_MACHWF2R_TXCHCNT_0              (0x1UL << ETH_MACHWF2R_TXCHCNT_Pos)                  /*!< 0x00040000 */
#define ETH_MACHWF2R_TXCHCNT_1              (0x2UL << ETH_MACHWF2R_TXCHCNT_Pos)                  /*!< 0x00080000 */
#define ETH_MACHWF2R_TXCHCNT_2              (0x4UL << ETH_MACHWF2R_TXCHCNT_Pos)                  /*!< 0x00100000 */
#define ETH_MACHWF2R_TXCHCNT_3              (0x8UL << ETH_MACHWF2R_TXCHCNT_Pos)                  /*!< 0x00200000 */
#define ETH_MACHWF2R_TDCSZ_Pos              (22U)
#define ETH_MACHWF2R_TDCSZ_Msk              (0x3UL << ETH_MACHWF2R_TDCSZ_Pos)                    /*!< 0x00C00000 */
#define ETH_MACHWF2R_TDCSZ                  ETH_MACHWF2R_TDCSZ_Msk                              /*!< Tx DMA Descriptor Cache Size in terms of 16-byte descriptors */
#define ETH_MACHWF2R_PPSOUTNUM_Pos          (24U)
#define ETH_MACHWF2R_PPSOUTNUM_Msk          (0x7UL << ETH_MACHWF2R_PPSOUTNUM_Pos)                /*!< 0x07000000 */
#define ETH_MACHWF2R_PPSOUTNUM              ETH_MACHWF2R_PPSOUTNUM_Msk                          /*!< Number of PPS Outputs */
#define ETH_MACHWF2R_PPSOUTNUM_0            (0x1UL << ETH_MACHWF2R_PPSOUTNUM_Pos)                /*!< 0x01000000 */
#define ETH_MACHWF2R_PPSOUTNUM_1            (0x2UL << ETH_MACHWF2R_PPSOUTNUM_Pos)                /*!< 0x02000000 */
#define ETH_MACHWF2R_PPSOUTNUM_2            (0x4UL << ETH_MACHWF2R_PPSOUTNUM_Pos)                /*!< 0x04000000 */
#define ETH_MACHWF2R_AUXSNAPNUM_Pos         (28U)
#define ETH_MACHWF2R_AUXSNAPNUM_Msk         (0x7UL << ETH_MACHWF2R_AUXSNAPNUM_Pos)               /*!< 0x70000000 */
#define ETH_MACHWF2R_AUXSNAPNUM             ETH_MACHWF2R_AUXSNAPNUM_Msk                         /*!< Number of Auxiliary Snapshot Inputs */
#define ETH_MACHWF2R_AUXSNAPNUM_0           (0x1UL << ETH_MACHWF2R_AUXSNAPNUM_Pos)               /*!< 0x10000000 */
#define ETH_MACHWF2R_AUXSNAPNUM_1           (0x2UL << ETH_MACHWF2R_AUXSNAPNUM_Pos)               /*!< 0x20000000 */
#define ETH_MACHWF2R_AUXSNAPNUM_2           (0x4UL << ETH_MACHWF2R_AUXSNAPNUM_Pos)               /*!< 0x40000000 */

