STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_ca35.h
/*******************  Bit definition for GPIO_OR register  ********************/

/*****************  Bit definition for GPIO_SECCFGR register  *****************/
#define GPIO_SECCFGR_SEC0_Pos          (0U)
#define GPIO_SECCFGR_SEC0_Msk          (0x1UL << GPIO_SECCFGR_SEC0_Pos)          /*!< 0x00000001 */
#define GPIO_SECCFGR_SEC0              GPIO_SECCFGR_SEC0_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC1_Pos          (1U)
#define GPIO_SECCFGR_SEC1_Msk          (0x1UL << GPIO_SECCFGR_SEC1_Pos)          /*!< 0x00000002 */
#define GPIO_SECCFGR_SEC1              GPIO_SECCFGR_SEC1_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC2_Pos          (2U)
#define GPIO_SECCFGR_SEC2_Msk          (0x1UL << GPIO_SECCFGR_SEC2_Pos)          /*!< 0x00000004 */
#define GPIO_SECCFGR_SEC2              GPIO_SECCFGR_SEC2_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC3_Pos          (3U)
#define GPIO_SECCFGR_SEC3_Msk          (0x1UL << GPIO_SECCFGR_SEC3_Pos)          /*!< 0x00000008 */
#define GPIO_SECCFGR_SEC3              GPIO_SECCFGR_SEC3_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC4_Pos          (4U)
#define GPIO_SECCFGR_SEC4_Msk          (0x1UL << GPIO_SECCFGR_SEC4_Pos)          /*!< 0x00000010 */
#define GPIO_SECCFGR_SEC4              GPIO_SECCFGR_SEC4_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC5_Pos          (5U)
#define GPIO_SECCFGR_SEC5_Msk          (0x1UL << GPIO_SECCFGR_SEC5_Pos)          /*!< 0x00000020 */
#define GPIO_SECCFGR_SEC5              GPIO_SECCFGR_SEC5_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC6_Pos          (6U)
#define GPIO_SECCFGR_SEC6_Msk          (0x1UL << GPIO_SECCFGR_SEC6_Pos)          /*!< 0x00000040 */
#define GPIO_SECCFGR_SEC6              GPIO_SECCFGR_SEC6_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC7_Pos          (7U)
#define GPIO_SECCFGR_SEC7_Msk          (0x1UL << GPIO_SECCFGR_SEC7_Pos)          /*!< 0x00000080 */
#define GPIO_SECCFGR_SEC7              GPIO_SECCFGR_SEC7_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC8_Pos          (8U)
#define GPIO_SECCFGR_SEC8_Msk          (0x1UL << GPIO_SECCFGR_SEC8_Pos)          /*!< 0x00000100 */
#define GPIO_SECCFGR_SEC8              GPIO_SECCFGR_SEC8_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC9_Pos          (9U)
#define GPIO_SECCFGR_SEC9_Msk          (0x1UL << GPIO_SECCFGR_SEC9_Pos)          /*!< 0x00000200 */
#define GPIO_SECCFGR_SEC9              GPIO_SECCFGR_SEC9_Msk                    /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC10_Pos         (10U)
#define GPIO_SECCFGR_SEC10_Msk         (0x1UL << GPIO_SECCFGR_SEC10_Pos)         /*!< 0x00000400 */
#define GPIO_SECCFGR_SEC10             GPIO_SECCFGR_SEC10_Msk                   /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC11_Pos         (11U)
#define GPIO_SECCFGR_SEC11_Msk         (0x1UL << GPIO_SECCFGR_SEC11_Pos)         /*!< 0x00000800 */
#define GPIO_SECCFGR_SEC11             GPIO_SECCFGR_SEC11_Msk                   /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC12_Pos         (12U)
#define GPIO_SECCFGR_SEC12_Msk         (0x1UL << GPIO_SECCFGR_SEC12_Pos)         /*!< 0x00001000 */
#define GPIO_SECCFGR_SEC12             GPIO_SECCFGR_SEC12_Msk                   /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC13_Pos         (13U)
#define GPIO_SECCFGR_SEC13_Msk         (0x1UL << GPIO_SECCFGR_SEC13_Pos)         /*!< 0x00002000 */
#define GPIO_SECCFGR_SEC13             GPIO_SECCFGR_SEC13_Msk                   /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC14_Pos         (14U)
#define GPIO_SECCFGR_SEC14_Msk         (0x1UL << GPIO_SECCFGR_SEC14_Pos)         /*!< 0x00004000 */
#define GPIO_SECCFGR_SEC14             GPIO_SECCFGR_SEC14_Msk                   /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */
#define GPIO_SECCFGR_SEC15_Pos         (15U)
#define GPIO_SECCFGR_SEC15_Msk         (0x1UL << GPIO_SECCFGR_SEC15_Pos)         /*!< 0x00008000 */
#define GPIO_SECCFGR_SEC15             GPIO_SECCFGR_SEC15_Msk                   /*!< Port x secure I/O pin y (y= 0 to 15)These bits are written by software to enabled the secure mode for I/O port pin y.If the system is not secure (TZEN=0) write to this bit is ignored.This bit can only be written by secure application. If corresponding PRIVy bit is set in GPIOx_PRIVCFGR this bit can only be written by secure privileged application.If compartment filtering for this I/O pin is enabled by setting CFEN bit in GPIOx_CIDCFGRy, only an allowed compartment can write this bit, on top of secure and privileged restriction. Authorized compartment value depends on the value of SEM_EN bit in GPIOx_CIDCFGRy and optionally the SEM_MUTEX bit in GPIOx_SEMCRy. See the bits descriptions for details. */

