STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_ca35.h
/****************  Bit definition for LTDC_LxCFBLNR register  *****************/
#define LTDC_LxCFBLNR_CFBLNBR_Pos     (0U)
#define LTDC_LxCFBLNR_CFBLNBR_Msk     (0xFFFFUL << LTDC_LxCFBLNR_CFBLNBR_Pos)           /*!< 0x0000FFFF */
#define LTDC_LxCFBLNR_CFBLNBR         LTDC_LxCFBLNR_CFBLNBR_Msk  /*!< frame buffer line number  */

/****************  Bit definition for LTDC_LxAFBA0R register  *****************/
#define LTDC_LxAFBA0R_AFBADD0_Pos     (0U)
#define LTDC_LxAFBA0R_AFBADD0_Msk     (0xFFFFFFFFUL << LTDC_LxAFBA0R_AFBADD0_Pos)               /*!< 0xFFFFFFFF */
#define LTDC_LxAFBA0R_AFBADD0         LTDC_LxAFBA0R_AFBADD0_Msk  /*!< frame buffer start address */

/****************  Bit definition for LTDC_LxAFBA1R register  *****************/
#define LTDC_LxAFBA1R_AFBADD1_Pos     (0U)
#define LTDC_LxAFBA1R_AFBADD1_Msk     (0xFFFFFFFFUL << LTDC_LxAFBA1R_AFBADD1_Pos)               /*!< 0xFFFFFFFF */
#define LTDC_LxAFBA1R_AFBADD1         LTDC_LxAFBA1R_AFBADD1_Msk  /*!< auxiliary frame buffer start address */

/*****************  Bit definition for LTDC_LxAFBLR register  *****************/
#define LTDC_LxAFBLR_AFBLL_Pos        (0U)
#define LTDC_LxAFBLR_AFBLL_Msk        (0xFFFFUL << LTDC_LxAFBLR_AFBLL_Pos)        /*!< 0x0000FFFF */
#define LTDC_LxAFBLR_AFBLL            LTDC_LxAFBLR_AFBLL_Msk     /*!< auxiliary frame buffer line length */
#define LTDC_LxAFBLR_AFBP_Pos         (16U)
#define LTDC_LxAFBLR_AFBP_Msk         (0xFFFFUL << LTDC_LxAFBLR_AFBP_Pos)       /*!< 0xFFFF0000 */
#define LTDC_LxAFBLR_AFBP             LTDC_LxAFBLR_AFBP_Msk      /*!< auxiliary frame buffer pitch in bytes */

/****************  Bit definition for LTDC_LxAFBLNR register  *****************/
#define LTDC_LxAFBLNR_AFBLNBR_Pos     (0U)
#define LTDC_LxAFBLNR_AFBLNBR_Msk     (0xFFFFUL << LTDC_LxAFBLNR_AFBLNBR_Pos)           /*!< 0x0000FFFF */
#define LTDC_LxAFBLNR_AFBLNBR         LTDC_LxAFBLNR_AFBLNBR_Msk  /*!< auxiliary frame buffer line number  */

/****************  Bit definition for LTDC_LxCLUTWR register  *****************/
#define LTDC_LxCLUTWR_BLUE_Pos        (0U)
#define LTDC_LxCLUTWR_BLUE_Msk        (0xFFUL << LTDC_LxCLUTWR_BLUE_Pos)      /*!< 0x000000FF */
#define LTDC_LxCLUTWR_BLUE            LTDC_LxCLUTWR_BLUE_Msk     /*!< blue value */
#define LTDC_LxCLUTWR_GREEN_Pos       (8U)
#define LTDC_LxCLUTWR_GREEN_Msk       (0xFFUL << LTDC_LxCLUTWR_GREEN_Pos)       /*!< 0x0000FF00 */
#define LTDC_LxCLUTWR_GREEN           LTDC_LxCLUTWR_GREEN_Msk    /*!< green value */
#define LTDC_LxCLUTWR_RED_Pos         (16U)
#define LTDC_LxCLUTWR_RED_Msk         (0xFFUL << LTDC_LxCLUTWR_RED_Pos)     /*!< 0x00FF0000 */
#define LTDC_LxCLUTWR_RED             LTDC_LxCLUTWR_RED_Msk      /*!< red value */
#define LTDC_LxCLUTWR_CLUTADD_Pos     (24U)
#define LTDC_LxCLUTWR_CLUTADD_Msk     (0xFFUL << LTDC_LxCLUTWR_CLUTADD_Pos)         /*!< 0xFF000000 */
#define LTDC_LxCLUTWR_CLUTADD         LTDC_LxCLUTWR_CLUTADD_Msk  /*!< CLUT address */

/*****************  Bit definition for LTDC_LxSISR register  ******************/
#define LTDC_LxSISR_SIH_Pos           (0U)
#define LTDC_LxSISR_SIH_Msk           (0xFFFUL << LTDC_LxSISR_SIH_Pos)    /*!< 0x00000FFF */
#define LTDC_LxSISR_SIH               LTDC_LxSISR_SIH_Msk        /*!< scaler horizontal input size (input width) */
#define LTDC_LxSISR_SIV_Pos           (16U)
#define LTDC_LxSISR_SIV_Msk           (0xFFFUL << LTDC_LxSISR_SIV_Pos)    /*!< 0x0FFF0000 */
#define LTDC_LxSISR_SIV               LTDC_LxSISR_SIV_Msk        /*!< scaler vertical input size (input height) */

/*****************  Bit definition for LTDC_LxSOSR register  ******************/
#define LTDC_LxSOSR_SOH_Pos           (0U)
#define LTDC_LxSOSR_SOH_Msk           (0xFFFUL << LTDC_LxSOSR_SOH_Pos)    /*!< 0x00000FFF */
#define LTDC_LxSOSR_SOH               LTDC_LxSOSR_SOH_Msk        /*!< scaler horizontal output size (output width) */
#define LTDC_LxSOSR_SOV_Pos           (16U)
#define LTDC_LxSOSR_SOV_Msk           (0xFFFUL << LTDC_LxSOSR_SOV_Pos)    /*!< 0x0FFF0000 */
#define LTDC_LxSOSR_SOV               LTDC_LxSOSR_SOV_Msk        /*!< scaler vertical output size (output height) */

/*****************  Bit definition for LTDC_LxSVSFR register  *****************/
#define LTDC_LxSVSFR_SVF_Pos          (0U)
#define LTDC_LxSVSFR_SVF_Msk          (0xFFFFUL << LTDC_LxSVSFR_SVF_Pos)      /*!< 0x0000FFFF */
#define LTDC_LxSVSFR_SVF              LTDC_LxSVSFR_SVF_Msk       /*!< scaler vertical scaling factor */

/*****************  Bit definition for LTDC_LxSVSPR register  *****************/
#define LTDC_LxSVSPR_SVP_Pos          (0U)
#define LTDC_LxSVSPR_SVP_Msk          (0xFFFFUL << LTDC_LxSVSPR_SVP_Pos)      /*!< 0x0000FFFF */
#define LTDC_LxSVSPR_SVP              LTDC_LxSVSPR_SVP_Msk       /*!< scaler vertical scaling factor */

/*****************  Bit definition for LTDC_LxSHSFR register  *****************/
#define LTDC_LxSHSFR_SHF_Pos          (0U)
#define LTDC_LxSHSFR_SHF_Msk          (0xFFFFUL << LTDC_LxSHSFR_SHF_Pos)      /*!< 0x0000FFFF */
#define LTDC_LxSHSFR_SHF              LTDC_LxSHSFR_SHF_Msk       /*!< scaler horizontal scaling factor */

/*****************  Bit definition for LTDC_LxSHSPR register  *****************/
#define LTDC_LxSHSPR_SHP_Pos          (0U)
#define LTDC_LxSHSPR_SHP_Msk          (0xFFFFUL << LTDC_LxSHSPR_SHP_Pos)      /*!< 0x0000FFFF */
#define LTDC_LxSHSPR_SHP              LTDC_LxSHSPR_SHP_Msk       /*!< scaler horizontal scaling phase */

/*****************  Bit definition for LTDC_LxCYR0R register  *****************/
#define LTDC_LxCYR0R_CR2R_Pos         (0U)
#define LTDC_LxCYR0R_CR2R_Msk         (0x3FFUL << LTDC_LxCYR0R_CR2R_Pos)      /*!< 0x000003FF */
#define LTDC_LxCYR0R_CR2R             LTDC_LxCYR0R_CR2R_Msk      /*!< Cr-to-Red coefficient, with bits 9:8 as positive integer and 7:0 as decimals */
#define LTDC_LxCYR0R_CB2B_Pos         (16U)
#define LTDC_LxCYR0R_CB2B_Msk         (0x3FFUL << LTDC_LxCYR0R_CB2B_Pos)      /*!< 0x03FF0000 */
#define LTDC_LxCYR0R_CB2B             LTDC_LxCYR0R_CB2B_Msk      /*!< Cb-to-Blue coefficient, with bits 9:8 as positive integer and 7:0 as decimals */

/*****************  Bit definition for LTDC_LxCYR1R register  *****************/
#define LTDC_LxCYR1R_CR2G_Pos         (0U)
#define LTDC_LxCYR1R_CR2G_Msk         (0x3FFUL << LTDC_LxCYR1R_CR2G_Pos)      /*!< 0x000003FF */
#define LTDC_LxCYR1R_CR2G             LTDC_LxCYR1R_CR2G_Msk      /*!< Cr-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals */
#define LTDC_LxCYR1R_CB2G_Pos         (16U)
#define LTDC_LxCYR1R_CB2G_Msk         (0x3FFUL << LTDC_LxCYR1R_CB2G_Pos)      /*!< 0x03FF0000 */
#define LTDC_LxCYR1R_CB2G             LTDC_LxCYR1R_CB2G_Msk      /*!< Cb-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals */

/******************************************************************************/
/*                                                                            */
/*                                 MDF/ADF                                    */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for MDF/ADF_GCR register  ********************/
#define MDF_GCR_TRGO_Pos                    (0U)
#define MDF_GCR_TRGO_Msk                    (0x1UL << MDF_GCR_TRGO_Pos)             /*!< 0x00000001 */
#define MDF_GCR_TRGO                        MDF_GCR_TRGO_Msk                        /*!<Trigger output control */
#define MDF_GCR_ILVNB_Pos                   (4U)
#define MDF_GCR_ILVNB_Msk                   (0xFUL << MDF_GCR_ILVNB_Pos)            /*!< 0x000000F0 */
#define MDF_GCR_ILVNB                       MDF_GCR_ILVNB_Msk                       /*!< Interleaved Number */

