STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_ca35.h
/* Bit fields for RCC_GRSTCSETR register */
#define RCC_GRSTCSETR_SYSRST_Pos                   (0U)
#define RCC_GRSTCSETR_SYSRST_Msk                   (0x1UL << RCC_GRSTCSETR_SYSRST_Pos)                  /*!< 0x00000001 */
#define RCC_GRSTCSETR_SYSRST                     RCC_GRSTCSETR_SYSRST_Msk                          /*!< System reset */

/* Bit fields for RCC_C1RSTCSETR register */
#define RCC_C1RSTCSETR_C1RST_Pos                   (0U)
#define RCC_C1RSTCSETR_C1RST_Msk                   (0x1UL << RCC_C1RSTCSETR_C1RST_Pos)                  /*!< 0x00000001 */
#define RCC_C1RSTCSETR_C1RST                     RCC_C1RSTCSETR_C1RST_Msk                          /*!< CPU1 reset */

/* Bit fields for RCC_C2RSTCSETR register */
#define RCC_C2RSTCSETR_C2RST_Pos                   (0U)
#define RCC_C2RSTCSETR_C2RST_Msk                   (0x1UL << RCC_C2RSTCSETR_C2RST_Pos)                  /*!< 0x00000001 */
#define RCC_C2RSTCSETR_C2RST                       RCC_C2RSTCSETR_C2RST_Msk                          /*!< CPU2 reset */

/* Bit fields for RCC_HWRSTSCLRR register */
#define RCC_HWRSTSCLRR_PORRSTF_Pos                 (0U)
#define RCC_HWRSTSCLRR_PORRSTF_Msk                 (0x1UL << RCC_HWRSTSCLRR_PORRSTF_Pos)                /*!< 0x00000001 */
#define RCC_HWRSTSCLRR_PORRSTF                     RCC_HWRSTSCLRR_PORRSTF_Msk                        /*!< POR/PDR reset flag */
#define RCC_HWRSTSCLRR_BORRSTF_Pos                 (1U)
#define RCC_HWRSTSCLRR_BORRSTF_Msk                 (0x1UL << RCC_HWRSTSCLRR_BORRSTF_Pos)                /*!< 0x00000002 */
#define RCC_HWRSTSCLRR_BORRSTF                     RCC_HWRSTSCLRR_BORRSTF_Msk                        /*!< BOR reset flag */
#define RCC_HWRSTSCLRR_PADRSTF_Pos                 (2U)
#define RCC_HWRSTSCLRR_PADRSTF_Msk                 (0x1UL << RCC_HWRSTSCLRR_PADRSTF_Pos)                /*!< 0x00000004 */
#define RCC_HWRSTSCLRR_PADRSTF                     RCC_HWRSTSCLRR_PADRSTF_Msk                        /*!< NRST reset flag */
#define RCC_HWRSTSCLRR_HCSSRSTF_Pos                (3U)
#define RCC_HWRSTSCLRR_HCSSRSTF_Msk                (0x1UL << RCC_HWRSTSCLRR_HCSSRSTF_Pos)               /*!< 0x00000008 */
#define RCC_HWRSTSCLRR_HCSSRSTF                    RCC_HWRSTSCLRR_HCSSRSTF_Msk                       /*!< HSE CSS reset flag */
#define RCC_HWRSTSCLRR_VCORERSTF_Pos               (4U)
#define RCC_HWRSTSCLRR_VCORERSTF_Msk               (0x1UL << RCC_HWRSTSCLRR_VCORERSTF_Pos)              /*!< 0x00000010 */
#define RCC_HWRSTSCLRR_VCORERSTF                   RCC_HWRSTSCLRR_VCORERSTF_Msk                      /*!< VDDCORE reset flag */
#define RCC_HWRSTSCLRR_SYSC1RSTF_Pos               (5U)
#define RCC_HWRSTSCLRR_SYSC1RSTF_Msk               (0x1UL << RCC_HWRSTSCLRR_SYSC1RSTF_Pos)              /*!< 0x00000020 */
#define RCC_HWRSTSCLRR_SYSC1RSTF                   RCC_HWRSTSCLRR_SYSC1RSTF_Msk                      /*!< CPU1 system reset flag */
#define RCC_HWRSTSCLRR_SYSC2RSTF_Pos               (6U)
#define RCC_HWRSTSCLRR_SYSC2RSTF_Msk               (0x1UL << RCC_HWRSTSCLRR_SYSC2RSTF_Pos)              /*!< 0x00000040 */
#define RCC_HWRSTSCLRR_SYSC2RSTF                   RCC_HWRSTSCLRR_SYSC2RSTF_Msk                      /*!< CPU2 system reset flag */
#define RCC_HWRSTSCLRR_IWDG1SYSRSTF_Pos            (7U)
#define RCC_HWRSTSCLRR_IWDG1SYSRSTF_Msk            (0x1UL << RCC_HWRSTSCLRR_IWDG1SYSRSTF_Pos)           /*!< 0x00000080 */
#define RCC_HWRSTSCLRR_IWDG1SYSRSTF                RCC_HWRSTSCLRR_IWDG1SYSRSTF_Msk                   /*!< IWDG1 system reset flag */
#define RCC_HWRSTSCLRR_IWDG2SYSRSTF_Pos            (8U)
#define RCC_HWRSTSCLRR_IWDG2SYSRSTF_Msk            (0x1UL << RCC_HWRSTSCLRR_IWDG2SYSRSTF_Pos)           /*!< 0x00000100 */
#define RCC_HWRSTSCLRR_IWDG2SYSRSTF                RCC_HWRSTSCLRR_IWDG2SYSRSTF_Msk                   /*!< IWDG2 system reset flag */
#define RCC_HWRSTSCLRR_IWDG3SYSRSTF_Pos            (9U)
#define RCC_HWRSTSCLRR_IWDG3SYSRSTF_Msk            (0x1UL << RCC_HWRSTSCLRR_IWDG3SYSRSTF_Pos)           /*!< 0x00000200 */
#define RCC_HWRSTSCLRR_IWDG3SYSRSTF                RCC_HWRSTSCLRR_IWDG3SYSRSTF_Msk                   /*!< IWDG3 system reset flag */
#define RCC_HWRSTSCLRR_IWDG4SYSRSTF_Pos            (10U)
#define RCC_HWRSTSCLRR_IWDG4SYSRSTF_Msk            (0x1UL << RCC_HWRSTSCLRR_IWDG4SYSRSTF_Pos)           /*!< 0x00000400 */
#define RCC_HWRSTSCLRR_IWDG4SYSRSTF                RCC_HWRSTSCLRR_IWDG4SYSRSTF_Msk                   /*!< IWDG4 system reset flag */
#define RCC_HWRSTSCLRR_RETCRCERRRSTF_Pos           (12U)
#define RCC_HWRSTSCLRR_RETCRCERRRSTF_Msk           (0x1UL << RCC_HWRSTSCLRR_RETCRCERRRSTF_Pos)          /*!< 0x00001000 */
#define RCC_HWRSTSCLRR_RETCRCERRRSTF               RCC_HWRSTSCLRR_RETCRCERRRSTF_Msk                    /*!< RETRAM CRC error reset flag */
#define RCC_HWRSTSCLRR_RETECCFAILCRCRSTF_Pos       (13U)
#define RCC_HWRSTSCLRR_RETECCFAILCRCRSTF_Msk       (0x1UL << RCC_HWRSTSCLRR_RETECCFAILCRCRSTF_Pos)      /*!< 0x00002000 */
#define RCC_HWRSTSCLRR_RETECCFAILCRCRSTF           RCC_HWRSTSCLRR_RETECCFAILCRCRSTF_Msk                /*!< RETRAM ECC failure reset flag during the CRC computation phase */
#define RCC_HWRSTSCLRR_RETECCFAILRESTRSTF_Pos      (14U)
#define RCC_HWRSTSCLRR_RETECCFAILRESTRSTF_Msk      (0x1UL << RCC_HWRSTSCLRR_RETECCFAILRESTRSTF_Pos)     /*!< 0x00004000 */
#define RCC_HWRSTSCLRR_RETECCFAILRESTRSTF          RCC_HWRSTSCLRR_RETECCFAILRESTRSTF_Msk               /*!< RETRAM ECC failure reset flag during system restoration phase */

/***************  Bit fields for RCC_C1HWRSTSCLRR register  ***************/
#define RCC_C1HWRSTSCLRR_VCPURSTF_Pos              (0U)
#define RCC_C1HWRSTSCLRR_VCPURSTF_Msk              (0x1UL << RCC_C1HWRSTSCLRR_VCPURSTF_Pos)             /*!< 0x00000001 */
#define RCC_C1HWRSTSCLRR_VCPURSTF                  RCC_C1HWRSTSCLRR_VCPURSTF_Msk                     /*!< VDDCPU reset flag */
#define RCC_C1HWRSTSCLRR_C1RSTF_Pos                (1U)
#define RCC_C1HWRSTSCLRR_C1RSTF_Msk                (0x1UL << RCC_C1HWRSTSCLRR_C1RSTF_Pos)               /*!< 0x00000002 */
#define RCC_C1HWRSTSCLRR_C1RSTF                    RCC_C1HWRSTSCLRR_C1RSTF_Msk                       /*!< CPU1 reset flag */
                  
/***************  Bit fields for RCC_C2HWRSTSCLRR register  ***************/
#define RCC_C2HWRSTSCLRR_C2RSTF_Pos                (0U)
#define RCC_C2HWRSTSCLRR_C2RSTF_Msk                (0x1UL << RCC_C2HWRSTSCLRR_C2RSTF_Pos)               /*!< 0x00000001 */
#define RCC_C2HWRSTSCLRR_C2RSTF                    RCC_C2HWRSTSCLRR_C2RSTF_Msk                       /*!< CPU2 reset flag */

