STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_ca35.h
#define SDMMC_MASK_BUSYD0ENDIE_Pos       (21U)
#define SDMMC_MASK_BUSYD0ENDIE_Msk       (0x1UL << SDMMC_MASK_BUSYD0ENDIE_Pos) /*!< 0x00200000 */
#define SDMMC_MASK_BUSYD0ENDIE           SDMMC_MASK_BUSYD0ENDIE_Msk            /*!<BUSYD0ENDIE interrupt Enable */
#define SDMMC_MASK_SDIOITIE_Pos          (22U)
#define SDMMC_MASK_SDIOITIE_Msk          (0x1UL << SDMMC_MASK_SDIOITIE_Pos)    /*!< 0x00400000 */
#define SDMMC_MASK_SDIOITIE              SDMMC_MASK_SDIOITIE_Msk               /*!<SDMMC Mode Interrupt Received interrupt Enable */
#define SDMMC_MASK_ACKFAILIE_Pos         (23U)
#define SDMMC_MASK_ACKFAILIE_Msk         (0x1UL << SDMMC_MASK_ACKFAILIE_Pos)   /*!< 0x00800000 */
#define SDMMC_MASK_ACKFAILIE             SDMMC_MASK_ACKFAILIE_Msk              /*!<Acknowledgment Fail Interrupt Enable */
#define SDMMC_MASK_ACKTIMEOUTIE_Pos      (24U)
#define SDMMC_MASK_ACKTIMEOUTIE_Msk      (0x1UL << SDMMC_MASK_ACKTIMEOUTIE_Pos) /*!< 0x01000000 */
#define SDMMC_MASK_ACKTIMEOUTIE          SDMMC_MASK_ACKTIMEOUTIE_Msk           /*!<Acknowledgment timeout Interrupt Enable */
#define SDMMC_MASK_VSWENDIE_Pos          (25U)
#define SDMMC_MASK_VSWENDIE_Msk          (0x1UL << SDMMC_MASK_VSWENDIE_Pos)    /*!< 0x02000000 */
#define SDMMC_MASK_VSWENDIE              SDMMC_MASK_VSWENDIE_Msk               /*!<Voltage switch critical timing section completion Interrupt Enable */
#define SDMMC_MASK_CKSTOPIE_Pos          (26U)
#define SDMMC_MASK_CKSTOPIE_Msk          (0x1UL << SDMMC_MASK_CKSTOPIE_Pos)    /*!< 0x04000000 */
#define SDMMC_MASK_CKSTOPIE              SDMMC_MASK_CKSTOPIE_Msk               /*!<Voltage Switch clock stopped Interrupt Enable */
#define SDMMC_MASK_IDMABTCIE_Pos         (28U)
#define SDMMC_MASK_IDMABTCIE_Msk         (0x1UL << SDMMC_MASK_IDMABTCIE_Pos)   /*!< 0x10000000 */
#define SDMMC_MASK_IDMABTCIE             SDMMC_MASK_IDMABTCIE_Msk              /*!<IDMA buffer transfer complete Interrupt Enable */

/*****************  Bit definition for SDMMC_ACKTIME register  *****************/
#define SDMMC_ACKTIME_ACKTIME_Pos        (0U)
#define SDMMC_ACKTIME_ACKTIME_Msk        (0x1FFFFFFUL << SDMMC_ACKTIME_ACKTIME_Pos) /*!< 0x01FFFFFF */
#define SDMMC_ACKTIME_ACKTIME            SDMMC_ACKTIME_ACKTIME_Msk             /*!<Boot acknowledgment timeout period */

/****************  Bit definition for SDMMC_FIFOTHR register  ****************/
#define SDMMC_FIFOTHR_THR_Pos             (0U)
#define SDMMC_FIFOTHR_THR_Msk             (0xFUL << SDMMC_FIFOTHRR_THR_Pos)              /*!< 0x0000000F */
#define SDMMC_FIFOTHR_THR                 SDMMC_FIFOTHRR_THR_Msk                        /*!< FIFO threshold */

/******************  Bit definition for SDMMC_FIFO register  *******************/
#define SDMMC_FIFO_FIFODATA_Pos          (0U)
#define SDMMC_FIFO_FIFODATA_Msk          (0xFFFFFFFFUL << SDMMC_FIFO_FIFODATA_Pos) /*!< 0xFFFFFFFF */
#define SDMMC_FIFO_FIFODATA              SDMMC_FIFO_FIFODATA_Msk               /*!<Receive and transmit FIFO data */

/******************  Bit definition for SDMMC_IDMACTRL register ****************/
#define SDMMC_IDMA_IDMAEN_Pos            (0U)
#define SDMMC_IDMA_IDMAEN_Msk            (0x1UL << SDMMC_IDMA_IDMAEN_Pos)      /*!< 0x00000001 */
#define SDMMC_IDMA_IDMAEN                SDMMC_IDMA_IDMAEN_Msk                 /*!< Enable the internal DMA of the SDMMC peripheral */
#define SDMMC_IDMA_IDMABMODE_Pos         (1U)
#define SDMMC_IDMA_IDMABMODE_Msk         (0x1UL << SDMMC_IDMA_IDMABMODE_Pos)   /*!< 0x00000002 */
#define SDMMC_IDMA_IDMABMODE             SDMMC_IDMA_IDMABMODE_Msk              /*!< Enable Linked List mode for IDMA */

/*****************  Bit definition for SDMMC_IDMABSIZER register  **************/
#define SDMMC_IDMABSIZE_IDMABNDT_Pos     (5U)
#define SDMMC_IDMABSIZE_IDMABNDT_Msk     (0xFFFUL << SDMMC_IDMABSIZE_IDMABNDT_Pos) /*!< 0x0001FFE0 */
#define SDMMC_IDMABSIZE_IDMABNDT         SDMMC_IDMABSIZE_IDMABNDT_Msk          /*!< Number of bytes per buffer */

/*****************  Bit definition for SDMMC_IDMABASER register  ***************/
#define SDMMC_IDMABASER_IDMABASER_Pos    (0U)
#define SDMMC_IDMABASER_IDMABASER_Msk    (0xFFFFFFFFUL << SDMMC_IDMABASER_IDMABASER_Pos)/*!< 0xFFFFFFFF */
#define SDMMC_IDMABASER_IDMABASER        SDMMC_IDMABASER_IDMABASER_Msk         /*!< Memory base address register */

/*****************  Bit definition for SDMMC_IDMALAR register  ***************/
#define SDMMC_IDMALAR_IDMALA_Pos         (0U)
#define SDMMC_IDMALAR_IDMALA_Msk         (0x3FFFUL << SDMMC_IDMALAR_IDMALA_Pos)  /*!< 0x00003FFF */
#define SDMMC_IDMALAR_IDMALA             SDMMC_IDMALAR_IDMALA_Msk                /*!< Linked list item address offset */
#define SDMMC_IDMALAR_ABR_Pos            (29U)
#define SDMMC_IDMALAR_ABR_Msk            (0x1UL << SDMMC_IDMALAR_ABR_Pos)        /*!< 0x20000000 */
#define SDMMC_IDMALAR_ABR                SDMMC_IDMALAR_ABR_Msk                   /*!< Acknowledge linked list buffer ready */
#define SDMMC_IDMALAR_ULS_Pos            (30U)
#define SDMMC_IDMALAR_ULS_Msk            (0x1UL << SDMMC_IDMALAR_ULS_Pos)        /*!< 0x40000000 */
#define SDMMC_IDMALAR_ULS                SDMMC_IDMALAR_ULS_Msk                   /*!< Update Size from linked list */
#define SDMMC_IDMALAR_ULA_Pos            (31U)
#define SDMMC_IDMALAR_ULA_Msk            (0x1UL << SDMMC_IDMALAR_ULA_Pos)        /*!< 0x80000000 */
#define SDMMC_IDMALAR_ULA                SDMMC_IDMALAR_ULA_Msk                   /*!< Update Address from linked list */

/*****************  Bit definition for SDMMC_IDMABAR register  ***************/
#define SDMMC_IDMABAR_IDMABAR_Pos        (0U)
#define SDMMC_IDMABAR_IDMABAR_Msk        (0xFFFFFFFFUL << SDMMC_IDMABAR_IDMABAR_Pos)/*!< 0xFFFFFFFF */
#define SDMMC_IDMABAR_IDMABAR            SDMMC_IDMABAR_IDMABAR_Msk             /*!< linked list memory base register */

/****************  Bit definition for SDMMC_HWCFGR1 register  *****************/
#define SDMMC_HWCFGR1_FIFOSIZE_Pos         (0U)
#define SDMMC_HWCFGR1_FIFOSIZE_Msk         (0xFUL << SDMMC_HWCFGR1_FIFOSIZE_Pos)          /*!< 0x0000000F */
#define SDMMC_HWCFGR1_FIFOSIZE             SDMMC_HWCFGR1_FIFOSIZE_Msk                    /*!< SDMMC FIFO size */

/******************  Bit definition for SDMMC_VERR register  ******************/
#define SDMMC_VERR_MINREV_Pos              (0U)
#define SDMMC_VERR_MINREV_Msk              (0xFUL << SDMMC_VERR_MINREV_Pos)               /*!< 0x0000000F */
#define SDMMC_VERR_MINREV                  SDMMC_VERR_MINREV_Msk                         /*!< SDMMC minor revision number */
#define SDMMC_VERR_MAJREV_Pos              (4U)
#define SDMMC_VERR_MAJREV_Msk              (0xFUL << SDMMC_VERR_MAJREV_Pos)               /*!< 0x000000F0 */
#define SDMMC_VERR_MAJREV                  SDMMC_VERR_MAJREV_Msk                         /*!< SDMMC major revision number */

/*****************  Bit definition for SDMMC_IPIDR register  ******************/
#define SDMMC_IPIDR_IP_ID_Pos              (0U)
#define SDMMC_IPIDR_IP_ID_Msk              (0xFFFFFFFFUL << SDMMC_IPIDR_IP_ID_Pos)        /*!< 0xFFFFFFFF */
#define SDMMC_IPIDR_IP_ID                  SDMMC_IPIDR_IP_ID_Msk                         /*!< SDMMC identification */

/******************  Bit definition for SDMMC_SIDR register  ******************/
#define SDMMC_SIDR_SID_Pos                 (0U)
#define SDMMC_SIDR_SID_Msk                 (0xFFFFFFFFUL << SDMMC_SIDR_SID_Pos)           /*!< 0xFFFFFFFF */
#define SDMMC_SIDR_SID                     SDMMC_SIDR_SID_Msk                            /*!< SDMMC size identification */

/******************************************************************************/
/*                                                                            */
/*                           SERF/SERC Interface                              */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for SERC_IER0 register  *******************/
#define SERC_IER0_PDRIE0_Pos          (0U)
#define SERC_IER0_PDRIE0_Msk          (0x1UL << SERC_IER0_PDRIE0_Pos)     /*!< 0x00000001 */
#define SERC_IER0_PDRIE0              SERC_IER0_PDRIE0_Msk
#define SERC_IER0_PDRIE1_Pos          (1U)
#define SERC_IER0_PDRIE1_Msk          (0x1UL << SERC_IER0_PDRIE1_Pos)     /*!< 0x00000002 */
#define SERC_IER0_PDRIE1              SERC_IER0_PDRIE1_Msk
#define SERC_IER0_PDRIE2_Pos          (2U)
#define SERC_IER0_PDRIE2_Msk          (0x1UL << SERC_IER0_PDRIE2_Pos)     /*!< 0x00000004 */
#define SERC_IER0_PDRIE2              SERC_IER0_PDRIE2_Msk
#define SERC_IER0_PDRIE3_Pos          (3U)
#define SERC_IER0_PDRIE3_Msk          (0x1UL << SERC_IER0_PDRIE3_Pos)     /*!< 0x00000008 */
#define SERC_IER0_PDRIE3              SERC_IER0_PDRIE3_Msk
#define SERC_IER0_PDRIE4_Pos          (4U)
#define SERC_IER0_PDRIE4_Msk          (0x1UL << SERC_IER0_PDRIE4_Pos)     /*!< 0x00000010 */
#define SERC_IER0_PDRIE4              SERC_IER0_PDRIE4_Msk
#define SERC_IER0_PDRIE5_Pos          (5U)
#define SERC_IER0_PDRIE5_Msk          (0x1UL << SERC_IER0_PDRIE5_Pos)     /*!< 0x00000020 */
#define SERC_IER0_PDRIE5              SERC_IER0_PDRIE5_Msk
#define SERC_IER0_PDRIE6_Pos          (6U)
#define SERC_IER0_PDRIE6_Msk          (0x1UL << SERC_IER0_PDRIE6_Pos)     /*!< 0x00000040 */
#define SERC_IER0_PDRIE6              SERC_IER0_PDRIE6_Msk
#define SERC_IER0_PDRIE7_Pos          (7U)
#define SERC_IER0_PDRIE7_Msk          (0x1UL << SERC_IER0_PDRIE7_Pos)     /*!< 0x00000080 */
#define SERC_IER0_PDRIE7              SERC_IER0_PDRIE7_Msk
#define SERC_IER0_PDRIE8_Pos          (8U)
#define SERC_IER0_PDRIE8_Msk          (0x1UL << SERC_IER0_PDRIE8_Pos)     /*!< 0x00000100 */
#define SERC_IER0_PDRIE8              SERC_IER0_PDRIE8_Msk
#define SERC_IER0_PDRIE9_Pos          (9U)
#define SERC_IER0_PDRIE9_Msk          (0x1UL << SERC_IER0_PDRIE9_Pos)     /*!< 0x00000200 */
#define SERC_IER0_PDRIE9              SERC_IER0_PDRIE9_Msk
#define SERC_IER0_PDRIE10_Pos         (10U)
#define SERC_IER0_PDRIE10_Msk         (0x1UL << SERC_IER0_PDRIE10_Pos)    /*!< 0x00000400 */
#define SERC_IER0_PDRIE10             SERC_IER0_PDRIE10_Msk
#define SERC_IER0_PDRIE11_Pos         (11U)
#define SERC_IER0_PDRIE11_Msk         (0x1UL << SERC_IER0_PDRIE11_Pos)    /*!< 0x00000800 */
#define SERC_IER0_PDRIE11             SERC_IER0_PDRIE11_Msk
#define SERC_IER0_PDRIE12_Pos         (12U)
#define SERC_IER0_PDRIE12_Msk         (0x1UL << SERC_IER0_PDRIE12_Pos)    /*!< 0x00001000 */
#define SERC_IER0_PDRIE12             SERC_IER0_PDRIE12_Msk
#define SERC_IER0_PDRIE13_Pos         (13U)
#define SERC_IER0_PDRIE13_Msk         (0x1UL << SERC_IER0_PDRIE13_Pos)    /*!< 0x00002000 */
#define SERC_IER0_PDRIE13             SERC_IER0_PDRIE13_Msk
#define SERC_IER0_PDRIE14_Pos         (14U)
#define SERC_IER0_PDRIE14_Msk         (0x1UL << SERC_IER0_PDRIE14_Pos)    /*!< 0x00004000 */
#define SERC_IER0_PDRIE14             SERC_IER0_PDRIE14_Msk
#define SERC_IER0_PDRIE15_Pos         (15U)
#define SERC_IER0_PDRIE15_Msk         (0x1UL << SERC_IER0_PDRIE15_Pos)    /*!< 0x00008000 */
#define SERC_IER0_PDRIE15             SERC_IER0_PDRIE15_Msk
#define SERC_IER0_PDRIE16_Pos         (16U)
#define SERC_IER0_PDRIE16_Msk         (0x1UL << SERC_IER0_PDRIE16_Pos)    /*!< 0x00010000 */
#define SERC_IER0_PDRIE16             SERC_IER0_PDRIE16_Msk
#define SERC_IER0_PDRIE17_Pos         (17U)
#define SERC_IER0_PDRIE17_Msk         (0x1UL << SERC_IER0_PDRIE17_Pos)    /*!< 0x00020000 */
#define SERC_IER0_PDRIE17             SERC_IER0_PDRIE17_Msk
#define SERC_IER0_PDRIE18_Pos         (18U)
#define SERC_IER0_PDRIE18_Msk         (0x1UL << SERC_IER0_PDRIE18_Pos)    /*!< 0x00040000 */
#define SERC_IER0_PDRIE18             SERC_IER0_PDRIE18_Msk
#define SERC_IER0_PDRIE19_Pos         (19U)
#define SERC_IER0_PDRIE19_Msk         (0x1UL << SERC_IER0_PDRIE19_Pos)    /*!< 0x00080000 */
#define SERC_IER0_PDRIE19             SERC_IER0_PDRIE19_Msk
#define SERC_IER0_PDRIE20_Pos         (20U)
#define SERC_IER0_PDRIE20_Msk         (0x1UL << SERC_IER0_PDRIE20_Pos)    /*!< 0x00100000 */
#define SERC_IER0_PDRIE20             SERC_IER0_PDRIE20_Msk
#define SERC_IER0_PDRIE21_Pos         (21U)
#define SERC_IER0_PDRIE21_Msk         (0x1UL << SERC_IER0_PDRIE21_Pos)    /*!< 0x00200000 */
#define SERC_IER0_PDRIE21             SERC_IER0_PDRIE21_Msk
#define SERC_IER0_PDRIE22_Pos         (22U)
#define SERC_IER0_PDRIE22_Msk         (0x1UL << SERC_IER0_PDRIE22_Pos)    /*!< 0x00400000 */
#define SERC_IER0_PDRIE22             SERC_IER0_PDRIE22_Msk
#define SERC_IER0_PDRIE23_Pos         (23U)
#define SERC_IER0_PDRIE23_Msk         (0x1UL << SERC_IER0_PDRIE23_Pos)    /*!< 0x00800000 */
#define SERC_IER0_PDRIE23             SERC_IER0_PDRIE23_Msk
#define SERC_IER0_PDRIE24_Pos         (24U)
#define SERC_IER0_PDRIE24_Msk         (0x1UL << SERC_IER0_PDRIE24_Pos)    /*!< 0x01000000 */
#define SERC_IER0_PDRIE24             SERC_IER0_PDRIE24_Msk
#define SERC_IER0_PDRIE25_Pos         (25U)
#define SERC_IER0_PDRIE25_Msk         (0x1UL << SERC_IER0_PDRIE25_Pos)    /*!< 0x02000000 */
#define SERC_IER0_PDRIE25             SERC_IER0_PDRIE25_Msk
#define SERC_IER0_PDRIE26_Pos         (26U)
#define SERC_IER0_PDRIE26_Msk         (0x1UL << SERC_IER0_PDRIE26_Pos)    /*!< 0x04000000 */
#define SERC_IER0_PDRIE26             SERC_IER0_PDRIE26_Msk
#define SERC_IER0_PDRIE27_Pos         (27U)
#define SERC_IER0_PDRIE27_Msk         (0x1UL << SERC_IER0_PDRIE27_Pos)    /*!< 0x08000000 */
#define SERC_IER0_PDRIE27             SERC_IER0_PDRIE27_Msk
#define SERC_IER0_PDRIE28_Pos         (28U)
#define SERC_IER0_PDRIE28_Msk         (0x1UL << SERC_IER0_PDRIE28_Pos)    /*!< 0x10000000 */
#define SERC_IER0_PDRIE28             SERC_IER0_PDRIE28_Msk
#define SERC_IER0_PDRIE29_Pos         (29U)
#define SERC_IER0_PDRIE29_Msk         (0x1UL << SERC_IER0_PDRIE29_Pos)    /*!< 0x20000000 */
#define SERC_IER0_PDRIE29             SERC_IER0_PDRIE29_Msk
#define SERC_IER0_PDRIE30_Pos         (30U)
#define SERC_IER0_PDRIE30_Msk         (0x1UL << SERC_IER0_PDRIE30_Pos)    /*!< 0x40000000 */
#define SERC_IER0_PDRIE30             SERC_IER0_PDRIE30_Msk
#define SERC_IER0_PDRIE31_Pos         (31U)
#define SERC_IER0_PDRIE31_Msk         (0x1UL << SERC_IER0_PDRIE31_Pos)    /*!< 0x80000000 */
#define SERC_IER0_PDRIE31             SERC_IER0_PDRIE31_Msk

/******************  Bit definition for SERC_IER1 register  *******************/
#define SERC_IER1_PDRIE32_Pos         (0U)
#define SERC_IER1_PDRIE32_Msk         (0x1UL << SERC_IER1_PDRIE32_Pos)    /*!< 0x00000001 */
#define SERC_IER1_PDRIE32             SERC_IER1_PDRIE32_Msk
#define SERC_IER1_PDRIE33_Pos         (1U)
#define SERC_IER1_PDRIE33_Msk         (0x1UL << SERC_IER1_PDRIE33_Pos)    /*!< 0x00000002 */
#define SERC_IER1_PDRIE33             SERC_IER1_PDRIE33_Msk
#define SERC_IER1_PDRIE34_Pos         (2U)
#define SERC_IER1_PDRIE34_Msk         (0x1UL << SERC_IER1_PDRIE34_Pos)    /*!< 0x00000004 */
#define SERC_IER1_PDRIE34             SERC_IER1_PDRIE34_Msk
#define SERC_IER1_PDRIE35_Pos         (3U)
#define SERC_IER1_PDRIE35_Msk         (0x1UL << SERC_IER1_PDRIE35_Pos)    /*!< 0x00000008 */
#define SERC_IER1_PDRIE35             SERC_IER1_PDRIE35_Msk
#define SERC_IER1_PDRIE36_Pos         (4U)
#define SERC_IER1_PDRIE36_Msk         (0x1UL << SERC_IER1_PDRIE36_Pos)    /*!< 0x00000010 */
#define SERC_IER1_PDRIE36             SERC_IER1_PDRIE36_Msk
#define SERC_IER1_PDRIE37_Pos         (5U)
#define SERC_IER1_PDRIE37_Msk         (0x1UL << SERC_IER1_PDRIE37_Pos)    /*!< 0x00000020 */
#define SERC_IER1_PDRIE37             SERC_IER1_PDRIE37_Msk
#define SERC_IER1_PDRIE38_Pos         (6U)
#define SERC_IER1_PDRIE38_Msk         (0x1UL << SERC_IER1_PDRIE38_Pos)    /*!< 0x00000040 */
#define SERC_IER1_PDRIE38             SERC_IER1_PDRIE38_Msk
#define SERC_IER1_PDRIE39_Pos         (7U)
#define SERC_IER1_PDRIE39_Msk         (0x1UL << SERC_IER1_PDRIE39_Pos)    /*!< 0x00000080 */
#define SERC_IER1_PDRIE39             SERC_IER1_PDRIE39_Msk
#define SERC_IER1_PDRIE40_Pos         (8U)
#define SERC_IER1_PDRIE40_Msk         (0x1UL << SERC_IER1_PDRIE40_Pos)    /*!< 0x00000100 */
#define SERC_IER1_PDRIE40             SERC_IER1_PDRIE40_Msk
#define SERC_IER1_PDRIE41_Pos         (9U)
#define SERC_IER1_PDRIE41_Msk         (0x1UL << SERC_IER1_PDRIE41_Pos)    /*!< 0x00000200 */
#define SERC_IER1_PDRIE41             SERC_IER1_PDRIE41_Msk
#define SERC_IER1_PDRIE42_Pos         (10U)
#define SERC_IER1_PDRIE42_Msk         (0x1UL << SERC_IER1_PDRIE42_Pos)    /*!< 0x00000400 */
#define SERC_IER1_PDRIE42             SERC_IER1_PDRIE42_Msk
#define SERC_IER1_PDRIE43_Pos         (11U)
#define SERC_IER1_PDRIE43_Msk         (0x1UL << SERC_IER1_PDRIE43_Pos)    /*!< 0x00000800 */
#define SERC_IER1_PDRIE43             SERC_IER1_PDRIE43_Msk
#define SERC_IER1_PDRIE44_Pos         (12U)
#define SERC_IER1_PDRIE44_Msk         (0x1UL << SERC_IER1_PDRIE44_Pos)    /*!< 0x00001000 */
#define SERC_IER1_PDRIE44             SERC_IER1_PDRIE44_Msk
#define SERC_IER1_PDRIE45_Pos         (13U)
#define SERC_IER1_PDRIE45_Msk         (0x1UL << SERC_IER1_PDRIE45_Pos)    /*!< 0x00002000 */
#define SERC_IER1_PDRIE45             SERC_IER1_PDRIE45_Msk
#define SERC_IER1_PDRIE46_Pos         (14U)
#define SERC_IER1_PDRIE46_Msk         (0x1UL << SERC_IER1_PDRIE46_Pos)    /*!< 0x00004000 */
#define SERC_IER1_PDRIE46             SERC_IER1_PDRIE46_Msk
#define SERC_IER1_PDRIE47_Pos         (15U)
#define SERC_IER1_PDRIE47_Msk         (0x1UL << SERC_IER1_PDRIE47_Pos)    /*!< 0x00008000 */
#define SERC_IER1_PDRIE47             SERC_IER1_PDRIE47_Msk
#define SERC_IER1_PDRIE48_Pos         (16U)
#define SERC_IER1_PDRIE48_Msk         (0x1UL << SERC_IER1_PDRIE48_Pos)    /*!< 0x00010000 */
#define SERC_IER1_PDRIE48             SERC_IER1_PDRIE48_Msk
#define SERC_IER1_PDRIE49_Pos         (17U)
#define SERC_IER1_PDRIE49_Msk         (0x1UL << SERC_IER1_PDRIE49_Pos)    /*!< 0x00020000 */
#define SERC_IER1_PDRIE49             SERC_IER1_PDRIE49_Msk
#define SERC_IER1_PDRIE50_Pos         (18U)
#define SERC_IER1_PDRIE50_Msk         (0x1UL << SERC_IER1_PDRIE50_Pos)    /*!< 0x00040000 */
#define SERC_IER1_PDRIE50             SERC_IER1_PDRIE50_Msk
#define SERC_IER1_PDRIE51_Pos         (19U)
#define SERC_IER1_PDRIE51_Msk         (0x1UL << SERC_IER1_PDRIE51_Pos)    /*!< 0x00080000 */
#define SERC_IER1_PDRIE51             SERC_IER1_PDRIE51_Msk
#define SERC_IER1_PDRIE52_Pos         (20U)
#define SERC_IER1_PDRIE52_Msk         (0x1UL << SERC_IER1_PDRIE52_Pos)    /*!< 0x00100000 */
#define SERC_IER1_PDRIE52             SERC_IER1_PDRIE52_Msk
#define SERC_IER1_PDRIE53_Pos         (21U)
#define SERC_IER1_PDRIE53_Msk         (0x1UL << SERC_IER1_PDRIE53_Pos)    /*!< 0x00200000 */
#define SERC_IER1_PDRIE53             SERC_IER1_PDRIE53_Msk
#define SERC_IER1_PDRIE54_Pos         (22U)
#define SERC_IER1_PDRIE54_Msk         (0x1UL << SERC_IER1_PDRIE54_Pos)    /*!< 0x00400000 */
#define SERC_IER1_PDRIE54             SERC_IER1_PDRIE54_Msk
#define SERC_IER1_PDRIE55_Pos         (23U)
#define SERC_IER1_PDRIE55_Msk         (0x1UL << SERC_IER1_PDRIE55_Pos)    /*!< 0x00800000 */
#define SERC_IER1_PDRIE55             SERC_IER1_PDRIE55_Msk
#define SERC_IER1_PDRIE56_Pos         (24U)
#define SERC_IER1_PDRIE56_Msk         (0x1UL << SERC_IER1_PDRIE56_Pos)    /*!< 0x01000000 */
#define SERC_IER1_PDRIE56             SERC_IER1_PDRIE56_Msk
#define SERC_IER1_PDRIE57_Pos         (25U)
#define SERC_IER1_PDRIE57_Msk         (0x1UL << SERC_IER1_PDRIE57_Pos)    /*!< 0x02000000 */
#define SERC_IER1_PDRIE57             SERC_IER1_PDRIE57_Msk
#define SERC_IER1_PDRIE58_Pos         (26U)
#define SERC_IER1_PDRIE58_Msk         (0x1UL << SERC_IER1_PDRIE58_Pos)    /*!< 0x04000000 */
#define SERC_IER1_PDRIE58             SERC_IER1_PDRIE58_Msk
#define SERC_IER1_PDRIE59_Pos         (27U)
#define SERC_IER1_PDRIE59_Msk         (0x1UL << SERC_IER1_PDRIE59_Pos)    /*!< 0x08000000 */
#define SERC_IER1_PDRIE59             SERC_IER1_PDRIE59_Msk
#define SERC_IER1_PDRIE60_Pos         (28U)
#define SERC_IER1_PDRIE60_Msk         (0x1UL << SERC_IER1_PDRIE60_Pos)    /*!< 0x10000000 */
#define SERC_IER1_PDRIE60             SERC_IER1_PDRIE60_Msk
#define SERC_IER1_PDRIE61_Pos         (29U)
#define SERC_IER1_PDRIE61_Msk         (0x1UL << SERC_IER1_PDRIE61_Pos)    /*!< 0x20000000 */
#define SERC_IER1_PDRIE61             SERC_IER1_PDRIE61_Msk
#define SERC_IER1_PDRIE62_Pos         (30U)
#define SERC_IER1_PDRIE62_Msk         (0x1UL << SERC_IER1_PDRIE62_Pos)    /*!< 0x40000000 */
#define SERC_IER1_PDRIE62             SERC_IER1_PDRIE62_Msk
#define SERC_IER1_PDRIE63_Pos         (31U)
#define SERC_IER1_PDRIE63_Msk         (0x1UL << SERC_IER1_PDRIE63_Pos)    /*!< 0x80000000 */
#define SERC_IER1_PDRIE63             SERC_IER1_PDRIE63_Msk

