STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_ca35.h
/***************  Bit definition for SYSCFG_DLYBOS2SR register  ***************/
#define SYSCFG_DLYBOS2SR_LOCK_Pos                                     (0U)
#define SYSCFG_DLYBOS2SR_LOCK_Msk                                     (0x1UL << SYSCFG_DLYBOS2SR_LOCK_Pos)                                       /*!< 0x00000001 */
#define SYSCFG_DLYBOS2SR_LOCK                                         SYSCFG_DLYBOS2SR_LOCK_Msk                                                 /*!< - 1: The DLL is locked */
#define SYSCFG_DLYBOS2SR_RX_TAP_SEL_ACK_Pos                           (1U)
#define SYSCFG_DLYBOS2SR_RX_TAP_SEL_ACK_Msk                           (0x1UL << SYSCFG_DLYBOS2SR_RX_TAP_SEL_ACK_Pos)                             /*!< 0x00000002 */
#define SYSCFG_DLYBOS2SR_RX_TAP_SEL_ACK                               SYSCFG_DLYBOS2SR_RX_TAP_SEL_ACK_Msk                                       /*!< - 1: The RX delay has switched to the tap value specified in RX_TAP_SEL[5:0] */
#define SYSCFG_DLYBOS2SR_TX_TAP_SEL_ACK_Pos                           (2U)
#define SYSCFG_DLYBOS2SR_TX_TAP_SEL_ACK_Msk                           (0x1UL << SYSCFG_DLYBOS2SR_TX_TAP_SEL_ACK_Pos)                             /*!< 0x00000004 */
#define SYSCFG_DLYBOS2SR_TX_TAP_SEL_ACK                               SYSCFG_DLYBOS2SR_TX_TAP_SEL_ACK_Msk                                       /*!< - 1: The TX delay has switched to the tap value specified in TX_TAP_SEL[5:0] */

/**************  Bit definition for SYSCFG_VDENPURAMCR register  **************/
#define SYSCFG_VDENPURAMCR_VDERAM_EN_Pos                              (0U)
#define SYSCFG_VDENPURAMCR_VDERAM_EN_Msk                              (0x1UL << SYSCFG_VDENPURAMCR_VDERAM_EN_Pos)                                /*!< 0x00000001 */
#define SYSCFG_VDENPURAMCR_VDERAM_EN                                  SYSCFG_VDENPURAMCR_VDERAM_EN_Msk                                          /*!< VDEC RAM enable */
#define SYSCFG_VDENPURAMCR_NPURAM_EN_Pos                              (4U)
#define SYSCFG_VDENPURAMCR_NPURAM_EN_Msk                              (0x1UL << SYSCFG_VDENPURAMCR_NPURAM_EN_Pos)                                /*!< 0x00000010 */
#define SYSCFG_VDENPURAMCR_NPURAM_EN                                  SYSCFG_VDENPURAMCR_NPURAM_EN_Msk                                          /*!< NPU RAM enable */

/*************  Bit definition for SYSCFG_POTTAMPRSTCR register  **************/
#define SYSCFG_POTTAMPRSTCR_POTTAMPRESETMASK_Pos                      (0U)
#define SYSCFG_POTTAMPRSTCR_POTTAMPRESETMASK_Msk                      (0x1UL << SYSCFG_POTTAMPRSTCR_POTTAMPRESETMASK_Pos)                        /*!< 0x00000001 */
#define SYSCFG_POTTAMPRSTCR_POTTAMPRESETMASK                          SYSCFG_POTTAMPRSTCR_POTTAMPRESETMASK_Msk                                  /*!< This bit can be set by software to mask PKA, SAES, CRYP1/2, and HASH reset in case of potential tam */

/****************  Bit definition for SYSCFG_M33SSCR register  ****************/
#define SYSCFG_M33SSCR_FPU_IT_EN_Pos                                  (0U)
#define SYSCFG_M33SSCR_FPU_IT_EN_Msk                                  (0x3FUL << SYSCFG_M33SSCR_FPU_IT_EN_Pos)                                   /*!< 0x0000003F */
#define SYSCFG_M33SSCR_FPU_IT_EN                                      SYSCFG_M33SSCR_FPU_IT_EN_Msk                                              /*!< Floating point unit interrupt enable */
#define SYSCFG_M33SSCR_FPU_IT_EN_0                                    (0x1UL<<SYSCFG_M33SSCR_FPU_IT_EN_Pos)                                          /*!< 0x00000001 - Invalid operation Interrupt enable */
#define SYSCFG_M33SSCR_FPU_IT_EN_1                                    (0x2UL<<SYSCFG_M33SSCR_FPU_IT_EN_Pos)                                          /*!< 0x00000002 - Divide-by-zero interrupt enable */
#define SYSCFG_M33SSCR_FPU_IT_EN_2                                    (0x4UL<<SYSCFG_M33SSCR_FPU_IT_EN_Pos)                                          /*!< 0x00000004 - Overflow interrupt enable */
#define SYSCFG_M33SSCR_FPU_IT_EN_3                                    (0x8UL<<SYSCFG_M33SSCR_FPU_IT_EN_Pos)                                          /*!< 0x00000008 - Underflow interrupt enable */
#define SYSCFG_M33SSCR_FPU_IT_EN_4                                    (0x10UL<<SYSCFG_M33SSCR_FPU_IT_EN_Pos)                                         /*!< 0x00000010 - Inexact interrupt enable */
#define SYSCFG_M33SSCR_FPU_IT_EN_5                                    (0x20UL<<SYSCFG_M33SSCR_FPU_IT_EN_Pos)
#define SYSCFG_M33SSCR_LOCKSVTAIRCR_Pos                               (16U)
#define SYSCFG_M33SSCR_LOCKSVTAIRCR_Msk                               (0x1UL << SYSCFG_M33SSCR_LOCKSVTAIRCR_Pos)                                 /*!< 0x00010000 */
#define SYSCFG_M33SSCR_LOCKSVTAIRCR                                   SYSCFG_M33SSCR_LOCKSVTAIRCR_Msk                                           /*!< Prevent changes to: */
#define SYSCFG_M33SSCR_LOCKNSVTOR_Pos                                 (17U)
#define SYSCFG_M33SSCR_LOCKNSVTOR_Msk                                 (0x1UL << SYSCFG_M33SSCR_LOCKNSVTOR_Pos)                                   /*!< 0x00020000 */
#define SYSCFG_M33SSCR_LOCKNSVTOR                                     SYSCFG_M33SSCR_LOCKNSVTOR_Msk                                             /*!< Prevent changes to non-secure vector table base address */
#define SYSCFG_M33SSCR_LOCKSMPU_Pos                                   (18U)
#define SYSCFG_M33SSCR_LOCKSMPU_Msk                                   (0x1UL << SYSCFG_M33SSCR_LOCKSMPU_Pos)                                     /*!< 0x00040000 */
#define SYSCFG_M33SSCR_LOCKSMPU                                       SYSCFG_M33SSCR_LOCKSMPU_Msk                                               /*!< Prevent changes to programmed secure MPU memory regions */
#define SYSCFG_M33SSCR_LOCKNSMPU_Pos                                  (19U)
#define SYSCFG_M33SSCR_LOCKNSMPU_Msk                                  (0x1UL << SYSCFG_M33SSCR_LOCKNSMPU_Pos)                                    /*!< 0x00080000 */
#define SYSCFG_M33SSCR_LOCKNSMPU                                      SYSCFG_M33SSCR_LOCKNSMPU_Msk                                              /*!< Prevent changes to non-secure MPU memory regions already programmed */
#define SYSCFG_M33SSCR_LOCKSAU_Pos                                    (20U)
#define SYSCFG_M33SSCR_LOCKSAU_Msk                                    (0x1UL << SYSCFG_M33SSCR_LOCKSAU_Pos)                                      /*!< 0x00100000 */
#define SYSCFG_M33SSCR_LOCKSAU                                        SYSCFG_M33SSCR_LOCKSAU_Msk                                                /*!< Prevent changes to secure SAU memory regions already programmed */

/***************  Bit definition for SYSCFG_ICNQPCR1 register  ****************/
#define SYSCFG_ICNQPCR1_A35_QOS_Pos                                   (0U)
#define SYSCFG_ICNQPCR1_A35_QOS_Msk                                   (0xFUL << SYSCFG_ICNQPCR1_A35_QOS_Pos)                                     /*!< 0x0000000F */
#define SYSCFG_ICNQPCR1_A35_QOS                                       SYSCFG_ICNQPCR1_A35_QOS_Msk                                               /*!< Cortex-A35 read/write channel QoS setting */
#define SYSCFG_ICNQPCR1_TRACE_QOS_Pos                                 (4U)
#define SYSCFG_ICNQPCR1_TRACE_QOS_Msk                                 (0xFUL << SYSCFG_ICNQPCR1_TRACE_QOS_Pos)                                   /*!< 0x000000F0 */
#define SYSCFG_ICNQPCR1_TRACE_QOS                                     SYSCFG_ICNQPCR1_TRACE_QOS_Msk                                             /*!< TRACE read/write channel QoS setting */
#define SYSCFG_ICNQPCR1_HPDMA1_QOS_Pos                                (8U)
#define SYSCFG_ICNQPCR1_HPDMA1_QOS_Msk                                (0xFUL << SYSCFG_ICNQPCR1_HPDMA1_QOS_Pos)                                  /*!< 0x00000F00 */
#define SYSCFG_ICNQPCR1_HPDMA1_QOS                                    SYSCFG_ICNQPCR1_HPDMA1_QOS_Msk                                            /*!< HPDMA1 read/write channel QoS setting */
#define SYSCFG_ICNQPCR1_HPDMA2_QOS_Pos                                (12U)
#define SYSCFG_ICNQPCR1_HPDMA2_QOS_Msk                                (0xFUL << SYSCFG_ICNQPCR1_HPDMA2_QOS_Pos)                                  /*!< 0x0000F000 */
#define SYSCFG_ICNQPCR1_HPDMA2_QOS                                    SYSCFG_ICNQPCR1_HPDMA2_QOS_Msk                                            /*!< HPDMA2 read/write channel QoS setting */
#define SYSCFG_ICNQPCR1_HPDMA3_QOS_Pos                                (16U)
#define SYSCFG_ICNQPCR1_HPDMA3_QOS_Msk                                (0xFUL << SYSCFG_ICNQPCR1_HPDMA3_QOS_Pos)                                  /*!< 0x000F0000 */
#define SYSCFG_ICNQPCR1_HPDMA3_QOS                                    SYSCFG_ICNQPCR1_HPDMA3_QOS_Msk                                            /*!< HPDMA3 read/write channel QoS setting */
#define SYSCFG_ICNQPCR1_SDMMC1_QOS_Pos                                (20U)
#define SYSCFG_ICNQPCR1_SDMMC1_QOS_Msk                                (0xFUL << SYSCFG_ICNQPCR1_SDMMC1_QOS_Pos)                                  /*!< 0x00F00000 */
#define SYSCFG_ICNQPCR1_SDMMC1_QOS                                    SYSCFG_ICNQPCR1_SDMMC1_QOS_Msk                                            /*!< SDMMC1 read/write channel QoS setting */
#define SYSCFG_ICNQPCR1_SDMMC2_QOS_Pos                                (24U)
#define SYSCFG_ICNQPCR1_SDMMC2_QOS_Msk                                (0xFUL << SYSCFG_ICNQPCR1_SDMMC2_QOS_Pos)                                  /*!< 0x0F000000 */
#define SYSCFG_ICNQPCR1_SDMMC2_QOS                                    SYSCFG_ICNQPCR1_SDMMC2_QOS_Msk                                            /*!< SDMMC2 read/write channes QoS setting */
#define SYSCFG_ICNQPCR1_SDMMC3_QOS_Pos                                (28U)
#define SYSCFG_ICNQPCR1_SDMMC3_QOS_Msk                                (0xFUL << SYSCFG_ICNQPCR1_SDMMC3_QOS_Pos)                                  /*!< 0xF0000000 */
#define SYSCFG_ICNQPCR1_SDMMC3_QOS                                    SYSCFG_ICNQPCR1_SDMMC3_QOS_Msk                                            /*!< SDMMC3 read/write channel QoS setting */

/***************  Bit definition for SYSCFG_ICNQPCR2 register  ****************/
#define SYSCFG_ICNQPCR2_USBH_QOS_Pos                                  (0U)
#define SYSCFG_ICNQPCR2_USBH_QOS_Msk                                  (0xFUL << SYSCFG_ICNQPCR2_USBH_QOS_Pos)                                    /*!< 0x0000000F */
#define SYSCFG_ICNQPCR2_USBH_QOS                                      SYSCFG_ICNQPCR2_USBH_QOS_Msk                                              /*!< USBH(OHCI and EHCI) read/write channel QoS setting */
#define SYSCFG_ICNQPCR2_OTG_QOS_Pos                                   (4U)
#define SYSCFG_ICNQPCR2_OTG_QOS_Msk                                   (0xFUL << SYSCFG_ICNQPCR2_OTG_QOS_Pos)                                     /*!< 0x000000F0 */
#define SYSCFG_ICNQPCR2_OTG_QOS                                       SYSCFG_ICNQPCR2_OTG_QOS_Msk                                               /*!< OTG read/write channel QoS setting */
#define SYSCFG_ICNQPCR2_DCMIPP_QOS_Pos                                (12U)
#define SYSCFG_ICNQPCR2_DCMIPP_QOS_Msk                                (0xFUL << SYSCFG_ICNQPCR2_DCMIPP_QOS_Pos)                                  /*!< 0x0000F000 */
#define SYSCFG_ICNQPCR2_DCMIPP_QOS                                    SYSCFG_ICNQPCR2_DCMIPP_QOS_Msk                                            /*!< DCMIPP write channel QoS setting */
#define SYSCFG_ICNQPCR2_LTDC_QOS_Pos                                  (16U)
#define SYSCFG_ICNQPCR2_LTDC_QOS_Msk                                  (0xFUL << SYSCFG_ICNQPCR2_LTDC_QOS_Pos)                                    /*!< 0x000F0000 */
#define SYSCFG_ICNQPCR2_LTDC_QOS                                      SYSCFG_ICNQPCR2_LTDC_QOS_Msk                                              /*!< LTDC read/write channels QoS setting */
#define SYSCFG_ICNQPCR2_VDEC_QOS_Pos                                  (24U)
#define SYSCFG_ICNQPCR2_VDEC_QOS_Msk                                  (0xFUL << SYSCFG_ICNQPCR2_VDEC_QOS_Pos)                                    /*!< 0x0F000000 */
#define SYSCFG_ICNQPCR2_VDEC_QOS                                      SYSCFG_ICNQPCR2_VDEC_QOS_Msk                                              /*!< VDEC read/write channels QoS setting */
#define SYSCFG_ICNQPCR2_GPU_QOS_Pos                                   (28U)
#define SYSCFG_ICNQPCR2_GPU_QOS_Msk                                   (0xFUL << SYSCFG_ICNQPCR2_GPU_QOS_Pos)                                     /*!< 0xF0000000 */
#define SYSCFG_ICNQPCR2_GPU_QOS                                       SYSCFG_ICNQPCR2_GPU_QOS_Msk                                               /*!< GPU/NPU read/write channel QoS setting */

/***************  Bit definition for SYSCFG_ICNEWRCR register  ****************/
#define SYSCFG_ICNEWRCR_USBH_EARLY_WR_RSP_ENABLE_Pos                  (0U)
#define SYSCFG_ICNEWRCR_USBH_EARLY_WR_RSP_ENABLE_Msk                  (0x1UL << SYSCFG_ICNEWRCR_USBH_EARLY_WR_RSP_ENABLE_Pos)                    /*!< 0x00000001 */
#define SYSCFG_ICNEWRCR_USBH_EARLY_WR_RSP_ENABLE                      SYSCFG_ICNEWRCR_USBH_EARLY_WR_RSP_ENABLE_Msk                              /*!< USBH (OHCI and EHCI) early write response enable */
#define SYSCFG_ICNEWRCR_SDMMC1_EARLY_WR_RSP_ENABLE_Pos                (1U)
#define SYSCFG_ICNEWRCR_SDMMC1_EARLY_WR_RSP_ENABLE_Msk                (0x1UL << SYSCFG_ICNEWRCR_SDMMC1_EARLY_WR_RSP_ENABLE_Pos)                  /*!< 0x00000002 */
#define SYSCFG_ICNEWRCR_SDMMC1_EARLY_WR_RSP_ENABLE                    SYSCFG_ICNEWRCR_SDMMC1_EARLY_WR_RSP_ENABLE_Msk                            /*!< SDMMC1 early write response enable */
#define SYSCFG_ICNEWRCR_SDMMC2_EARLY_WR_RSP_ENABLE_Pos                (2U)
#define SYSCFG_ICNEWRCR_SDMMC2_EARLY_WR_RSP_ENABLE_Msk                (0x1UL << SYSCFG_ICNEWRCR_SDMMC2_EARLY_WR_RSP_ENABLE_Pos)                  /*!< 0x00000004 */
#define SYSCFG_ICNEWRCR_SDMMC2_EARLY_WR_RSP_ENABLE                    SYSCFG_ICNEWRCR_SDMMC2_EARLY_WR_RSP_ENABLE_Msk                            /*!< SDMMC2 early write response enable */
#define SYSCFG_ICNEWRCR_SDMMC3_EARLY_WR_RSP_ENABLE_Pos                (3U)
#define SYSCFG_ICNEWRCR_SDMMC3_EARLY_WR_RSP_ENABLE_Msk                (0x1UL << SYSCFG_ICNEWRCR_SDMMC3_EARLY_WR_RSP_ENABLE_Pos)                  /*!< 0x00000008 */
#define SYSCFG_ICNEWRCR_SDMMC3_EARLY_WR_RSP_ENABLE                    SYSCFG_ICNEWRCR_SDMMC3_EARLY_WR_RSP_ENABLE_Msk                            /*!< SDMMC3 early write response enable */
#define SYSCFG_ICNEWRCR_LTDCR_DCMIPP_EARLY_WR_RSP_ENABLE_Pos          (4U)
#define SYSCFG_ICNEWRCR_LTDCR_DCMIPP_EARLY_WR_RSP_ENABLE_Msk          (0x1UL << SYSCFG_ICNEWRCR_LTDCR_DCMIPP_EARLY_WR_RSP_ENABLE_Pos)            /*!< 0x00000010 */
#define SYSCFG_ICNEWRCR_LTDCR_DCMIPP_EARLY_WR_RSP_ENABLE              SYSCFG_ICNEWRCR_LTDCR_DCMIPP_EARLY_WR_RSP_ENABLE_Msk                      /*!< LTDC Rotation and DCMIPP early write response enable */
#define SYSCFG_ICNEWRCR_OTG_EARLY_WR_RSP_ENABLE_Pos                   (5U)
#define SYSCFG_ICNEWRCR_OTG_EARLY_WR_RSP_ENABLE_Msk                   (0x1UL << SYSCFG_ICNEWRCR_OTG_EARLY_WR_RSP_ENABLE_Pos)                     /*!< 0x00000020 */
#define SYSCFG_ICNEWRCR_OTG_EARLY_WR_RSP_ENABLE                       SYSCFG_ICNEWRCR_OTG_EARLY_WR_RSP_ENABLE_Msk                               /*!< OTG early write response enable */

