STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213cxx_ca35.h
/****************  Bit definition for SYSCFG_ICNCGCR register  ****************/
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR_Pos                      (0U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR_Msk                      (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR_Pos)                        /*!< 0x00000001 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR                          SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DDR_Msk                                  /*!< When set to 1, ICN automatic clock gating on clk_icn_ddr domain is off */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY_Pos                  (1U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY_Msk                  (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY_Pos)                    /*!< 0x00000002 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY                      SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_DISPLAY_Msk                              /*!< When set to 1, ICN automatic clock gating on clk_icn_display domain is off */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL_Pos                      (2U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL_Msk                      (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL_Pos)                        /*!< 0x00000004 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL                          SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_HSL_Msk                                  /*!< When set to 1, ICN automatic clock gating on clk_icn_hsl domain is off */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU_Pos                      (3U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU_Msk                      (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU_Pos)                        /*!< 0x00000008 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU                          SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_MCU_Msk                                  /*!< When set to 1, ICN automatic clock gating on clk_icn_mcu domain is off */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB_Pos                   (4U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB_Msk                   (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB_Pos)                     /*!< 0x00000010 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB                       SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SYSATB_Msk                               /*!< When set to 1, ICN automatic clock gating on clk_icn_sysatb domain is off */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC_Pos                    (5U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC_Msk                    (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC_Pos)                      /*!< 0x00000020 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC                        SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_SDMMC_Msk                                /*!< When set to 1, ICN automatic clock gating on clk_icn_sdmmc domain is off */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM_Pos                 (6U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM_Msk                 (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM_Pos)                   /*!< 0x00000040 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM                     SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_BUSPERFM_Msk                             /*!< When set to 1, ICN automatic clock gating on clk_icn_busperfm domain is off */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID_Pos                      (7U)
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID_Msk                      (0x1UL << SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID_Pos)                        /*!< 0x00000080 */
#define SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID                          SYSCFG_ICNCGCR_ALWAYS_ON_CLK_ICN_VID_Msk                                  /*!< When set to 1, ICN automatic clock gating on clk_icn_vid domain is off */
#define SYSCFG_ICNCGCR_GPU_MEM_CLK_G_BYPASS_Pos                       (16U)
#define SYSCFG_ICNCGCR_GPU_MEM_CLK_G_BYPASS_Msk                       (0x1UL << SYSCFG_ICNCGCR_GPU_MEM_CLK_G_BYPASS_Pos)                         /*!< 0x00010000 */
#define SYSCFG_ICNCGCR_GPU_MEM_CLK_G_BYPASS                           SYSCFG_ICNCGCR_GPU_MEM_CLK_G_BYPASS_Msk                                   /*!< When set to 1, automatic clock gating of GPU memories are off */
#define SYSCFG_ICNCGCR_SECURITYSS_MEM_CLK_G_BYPASS_Pos                (17U)
#define SYSCFG_ICNCGCR_SECURITYSS_MEM_CLK_G_BYPASS_Msk                (0x1UL << SYSCFG_ICNCGCR_SECURITYSS_MEM_CLK_G_BYPASS_Pos)                  /*!< 0x00020000 */
#define SYSCFG_ICNCGCR_SECURITYSS_MEM_CLK_G_BYPASS                    SYSCFG_ICNCGCR_SECURITYSS_MEM_CLK_G_BYPASS_Msk                            /*!< When set to 1, automatic clock gating of Security subsystem memories are off */
#define SYSCFG_ICNCGCR_VIDEOSS_MEM_CLK_G_BYPASS_Pos                   (18U)
#define SYSCFG_ICNCGCR_VIDEOSS_MEM_CLK_G_BYPASS_Msk                   (0x1UL << SYSCFG_ICNCGCR_VIDEOSS_MEM_CLK_G_BYPASS_Pos)                     /*!< 0x00040000 */
#define SYSCFG_ICNCGCR_VIDEOSS_MEM_CLK_G_BYPASS                       SYSCFG_ICNCGCR_VIDEOSS_MEM_CLK_G_BYPASS_Msk                               /*!< When set to 1, automatic clock gating of Video subsystem memories are off */
#define SYSCFG_ICNCGCR_DDRSS_MEM_CLK_G_BYPASS_Pos                     (19U)
#define SYSCFG_ICNCGCR_DDRSS_MEM_CLK_G_BYPASS_Msk                     (0x1UL << SYSCFG_ICNCGCR_DDRSS_MEM_CLK_G_BYPASS_Pos)                       /*!< 0x00080000 */
#define SYSCFG_ICNCGCR_DDRSS_MEM_CLK_G_BYPASS                         SYSCFG_ICNCGCR_DDRSS_MEM_CLK_G_BYPASS_Msk                                 /*!< When set to 1, automatic clock gating of DDR subsystem memories are off */
#define SYSCFG_ICNCGCR_M33SS_MEM_CLK_G_BYPASS_Pos                     (20U)
#define SYSCFG_ICNCGCR_M33SS_MEM_CLK_G_BYPASS_Msk                     (0x1UL << SYSCFG_ICNCGCR_M33SS_MEM_CLK_G_BYPASS_Pos)                       /*!< 0x00100000 */
#define SYSCFG_ICNCGCR_M33SS_MEM_CLK_G_BYPASS                         SYSCFG_ICNCGCR_M33SS_MEM_CLK_G_BYPASS_Msk                                 /*!< When set to 1, automatic clock gating of M33 subsystem memories are off */
#define SYSCFG_ICNCGCR_RETRAM_CLK_G_BYPASS_Pos                        (21U)
#define SYSCFG_ICNCGCR_RETRAM_CLK_G_BYPASS_Msk                        (0x1UL << SYSCFG_ICNCGCR_RETRAM_CLK_G_BYPASS_Pos)                          /*!< 0x00200000 */
#define SYSCFG_ICNCGCR_RETRAM_CLK_G_BYPASS                            SYSCFG_ICNCGCR_RETRAM_CLK_G_BYPASS_Msk                                    /*!< When set to 1, automatic clock gating of Retram memory is off */
#define SYSCFG_ICNCGCR_SYSRAM_SRAM1_BKPSRAM_CLK_G_BYPASS_Pos          (22U)
#define SYSCFG_ICNCGCR_SYSRAM_SRAM1_BKPSRAM_CLK_G_BYPASS_Msk          (0x1UL << SYSCFG_ICNCGCR_SYSRAM_SRAM1_BKPSRAM_CLK_G_BYPASS_Pos)            /*!< 0x00400000 */
#define SYSCFG_ICNCGCR_SYSRAM_SRAM1_BKPSRAM_CLK_G_BYPASS              SYSCFG_ICNCGCR_SYSRAM_SRAM1_BKPSRAM_CLK_G_BYPASS_Msk                      /*!< When set to 1, automatic clock gating of Sysram, Sram1 and Bkpsram memories are off */
#define SYSCFG_ICNCGCR_FDCAN_MEM_CLK_G_BYPASS_Pos                     (23U)
#define SYSCFG_ICNCGCR_FDCAN_MEM_CLK_G_BYPASS_Msk                     (0x1UL << SYSCFG_ICNCGCR_FDCAN_MEM_CLK_G_BYPASS_Pos)                       /*!< 0x00800000 */
#define SYSCFG_ICNCGCR_FDCAN_MEM_CLK_G_BYPASS                         SYSCFG_ICNCGCR_FDCAN_MEM_CLK_G_BYPASS_Msk                                 /*!< When set to 1, automatic clock gating of FDCAN memory is off */
#define SYSCFG_ICNCGCR_ETF_MEM_CLK_G_BYPASS_Pos                       (24U)
#define SYSCFG_ICNCGCR_ETF_MEM_CLK_G_BYPASS_Msk                       (0x1UL << SYSCFG_ICNCGCR_ETF_MEM_CLK_G_BYPASS_Pos)                         /*!< 0x01000000 */
#define SYSCFG_ICNCGCR_ETF_MEM_CLK_G_BYPASS                           SYSCFG_ICNCGCR_ETF_MEM_CLK_G_BYPASS_Msk                                   /*!< When set to 1, automatic clock gating of ETF memory is off */

/**************  Bit definition for SYSCFG_ICNGPUBWLCR register  **************/
#define SYSCFG_ICNGPUBWLCR_PMEN_Pos                                   (0U)
#define SYSCFG_ICNGPUBWLCR_PMEN_Msk                                   (0x1UL << SYSCFG_ICNGPUBWLCR_PMEN_Pos)                                     /*!< 0x00000001 */
#define SYSCFG_ICNGPUBWLCR_PMEN                                       SYSCFG_ICNGPUBWLCR_PMEN_Msk                                               /*!< Panic Mode Enable */
#define SYSCFG_ICNGPUBWLCR_BWLEN_Pos                                  (1U)
#define SYSCFG_ICNGPUBWLCR_BWLEN_Msk                                  (0x1UL << SYSCFG_ICNGPUBWLCR_BWLEN_Pos)                                    /*!< 0x00000002 */
#define SYSCFG_ICNGPUBWLCR_BWLEN                                      SYSCFG_ICNGPUBWLCR_BWLEN_Msk                                              /*!< Bandwidth limiter enable */
#define SYSCFG_ICNGPUBWLCR_PMRSTDLY_Pos                               (2U)
#define SYSCFG_ICNGPUBWLCR_PMRSTDLY_Msk                               (0x3UL << SYSCFG_ICNGPUBWLCR_PMRSTDLY_Pos)                                 /*!< 0x0000000C */
#define SYSCFG_ICNGPUBWLCR_PMRSTDLY                                   SYSCFG_ICNGPUBWLCR_PMRSTDLY_Msk                                           /*!< Panic Mode Restart Delay */
#define SYSCFG_ICNGPUBWLCR_MAXABW_Pos                                 (8U)
#define SYSCFG_ICNGPUBWLCR_MAXABW_Msk                                 (0xFFUL << SYSCFG_ICNGPUBWLCR_MAXABW_Pos)                                  /*!< 0x0000FF00 */
#define SYSCFG_ICNGPUBWLCR_MAXABW                                     SYSCFG_ICNGPUBWLCR_MAXABW_Msk                                             /*!< Maximum allowed Bandwidth */

/**************  Bit definition for SYSCFG_ICNE2EBWRCR register  **************/
#define SYSCFG_ICNE2EBWRCR_CFG_ENABLE_Pos                             (0U)
#define SYSCFG_ICNE2EBWRCR_CFG_ENABLE_Msk                             (0x1UL << SYSCFG_ICNE2EBWRCR_CFG_ENABLE_Pos)                               /*!< 0x00000001 */
#define SYSCFG_ICNE2EBWRCR_CFG_ENABLE                                 SYSCFG_ICNE2EBWRCR_CFG_ENABLE_Msk                                         /*!< Activates the end-to-end bandwidth regulation */
#define SYSCFG_ICNE2EBWRCR_CFG_MODEL_Pos                              (1U)
#define SYSCFG_ICNE2EBWRCR_CFG_MODEL_Msk                              (0x3UL << SYSCFG_ICNE2EBWRCR_CFG_MODEL_Pos)                                /*!< 0x00000006 */
#define SYSCFG_ICNE2EBWRCR_CFG_MODEL                                  SYSCFG_ICNE2EBWRCR_CFG_MODEL_Msk                                          /*!< Defines the reactivity of the regulation feedback */
#define SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT_Pos                            (4U)
#define SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT_Msk                            (0x7UL << SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT_Pos)                              /*!< 0x00000070 */
#define SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT                                SYSCFG_ICNE2EBWRCR_CFG_ALL_TGT_Msk                                        /*!< Amount of empty CAM slots in DDR-CTRL that the regulation targets */
#define SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW_Pos                            (8U)
#define SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW_Msk                            (0x1UL << SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW_Pos)                              /*!< 0x00000100 */
#define SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW                                SYSCFG_ICNE2EBWRCR_CFG_CPU1_BW_Msk                                        /*!< Triple the bandwidth allowed to the CPU1 by the regulation */
#define SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW_Pos                           (9U)
#define SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW_Msk                           (0x1UL << SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW_Pos)                             /*!< 0x00000200 */
#define SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW                               SYSCFG_ICNE2EBWRCR_CFG_HPDMA_BW_Msk                                       /*!< Triple the bandwidth (BW) allowed to HPDMA1/2/3 by the regulation */

/***************  Bit definition for SYSCFG_SAFERSTCR register  ***************/
#define SYSCFG_SAFERSTCR_CFG_ENABLE_Pos                               (0U)
#define SYSCFG_SAFERSTCR_CFG_ENABLE_Msk                               (0x1UL << SYSCFG_SAFERSTCR_CFG_ENABLE_Pos)                                 /*!< 0x00000001 */
#define SYSCFG_SAFERSTCR_CFG_ENABLE                                   SYSCFG_SAFERSTCR_CFG_ENABLE_Msk                                           /*!< Activates the safe reset connector */

